[{"classTitle":"Minecraft Realm Virtual Community (Tuesdays)","classDescription":"Class Description: Weekly moderated sessions of a teen-led Minecraft Virtual Community! Participants will play together during set times. They discuss rules and coordinate their efforts and goals of their community. This is run by the teens with minimal adult interference. The current culture is of cooperation, negotiation and trading of resources. Trolling and griefing are not tolerated. Ages 10+ \n\nThis Survival Realm launched December 2022 as a CIRCLE class. It is hosted by Rachel (aka “Katarilla”, 13 years old) who has been building and moderating in Minecraft for 4+ years. Due to demand for this class and schedule changes, we are trying a new strategy of splitting into two sessions per week.\n\nScheduling: There will be TWO sessions available, please only sign up for ONE of them. Either Tuesays from 3-5pm or Fridays from 3-5pm. Students are welcome to play at any other time EXCEPT FOR 30 minutes before and after the Alternate Session Times. EX: if you’re in the Tuesday 3-5 session, you can be on the server any time EXCEPT FOR Fridays 2:30-5:30. Outside of session times, players can join until there are 10 on the server (the server capacity). Players may coordinate play for other times and are limited only by the server capacity. \n\nRequirements: This class is geared towards experienced Minecraft players (10 and up) with good verbal and some typing communication skills who enjoy cooperative online play in a survival based realm on Easy Difficulty. Participants should know how to craft, mine resources, build and fight off mobs. A set of headphones with a microphone is required to reduce background noise in group voice chat.\n\nCommunication: Voice chat will take place on a CIRCLE Milwaukee Discord server. Please arrange a time with Sara in the days before the class to set-up your discord and connect Minecraft accounts prior to the start of class. We prefer not to take class/session time to do this. If you have not participated before, please log in at least 20 minutes early on the first day. All participants’ parents may listen in to \"supervise\".\n\nNo-call, no-show policy will be strictly enforced per Circle policies because of the high demand of this class. We will have a wait list. \n\nTuesdays Group Dates: 9/5, 9/12, 9/26, 10/3, 10/10, 10/17, 10/24, 10/31, 11/7, 11/14, 11/21, 11/28 (no class 9/19)","displayLocation":"Discord/Minecraft, Online","date":"2023-09-05T00:00:00.000Z","startTime":"1899-12-30T15:00:00.000Z","endTime":"1899-12-30T17:00:00.000Z","repeats":"9/5, 9/12, 9/26, 10/3, 10/10, 10/17, 10/24, 10/31, 11/7, 11/14, 11/21, 11/28","classMinimum":2,"classMaximum":8,"fee":"none","supplies":"A PC or Tablet with the Bedrock version of Minecraft and Discord app downloaded. A set of headphones with a microphone. (please note: realms don't work with Java Edition)"},{"classTitle":"Cave Exploration at Ledge View Nature Center","classDescription":"With a naturalist, students hike to Carolyn's Caverns, a natural cave system in Silurian dolostone. They descend a ladder to enter, and are guided through the cave system, learning the geology and biology, with plenty of opportunities to crawl and explore in passages. The more fun they have, the dirtier they get! If the caves are wet, this means mud. Cave visitors wear long sleeves, pants, and closed-toe footwear (no sandals). A soft knit cap is recommended to protect the head from bumps. Cave visitors also bring their own flashlight.\n\nYou are invited to meet at the nature center at noon for a BYO picnic lunch in their outdoor pavillion. If you do not wish to bring a picnic lunch to enjoy on site, then please plan to arrive for the start of the cave tour program.\n\nThe cave tour program will begin promptly at 1pm and will run approximately 2-2.5 hours. Please be aware of the potentially significant drive time to the cave location depending on where you are coming from. \n\nThe nature center closes at 4pm and so we will need to leave by then, although the program itself will end before 4. \n\nThis program is geared toward students ages 7-15 approximately. Slightly younger children may attend but only if they can descend a ladder into the caves independently and remain in the cave system for the full course of the program. Slightly older students may attend if interested. No one aged 5 or younger is permitted in the cave. \n\nAt least one parent/chaperone per family is expected to attend and go into the cave with the group. \n\nPlease wear long sleeves, pants, closed toe shoes, and a soft knit cap to protect your head. Bring your own flashlights. Plan to get dirty!","displayLocation":"Ledge View Nature Center, W2348 Short Road, Chilton, WI 53014","date":"2023-09-07T00:00:00.000Z","startTime":"1899-12-30T13:00:00.000Z","endTime":"1899-12-30T16:00:00.000Z","repeats":"No","classMinimum":12,"classMaximum":46,"fee":"$6.50/person (all ages)","supplies":"Wear long sleeves, pants, closed toe shoes, and bring a flashlight! \n\nBring a picnic lunch if you choose to meet early to eat at the center."},{"classTitle":"Minecraft Realm Virtual Community (Fridays)","classDescription":"Class Description: Weekly moderated sessions of a teen-led Minecraft Virtual Community! Participants will play together during set times. They discuss rules and coordinate their efforts and goals of their community. This is run by the teens with minimal adult interference. The current culture is of cooperation, negotiation and trading of resources. Trolling and griefing are not tolerated. Ages 10+ \n\nThis Survival Realm launched December 2022 as a CIRCLE class. It is hosted by Rachel (aka “Katarilla”, 13 years old) who has been building and moderating in Minecraft for 4+ years. Due to demand for this class and schedule changes, we are trying a new strategy of splitting into two sessions per week.\n\nScheduling: There will be TWO sessions available, please only sign up for ONE of them. Either Tuesays from 3-5pm or Fridays from 3-5pm. Students are welcome to play at any other time EXCEPT FOR 30 minutes before and after the Alternate Session Times. EX: if you’re in the Tuesday 3-5 session, you can be on the server any time EXCEPT FOR Fridays 2:30-5:30. Outside of session times, players can join until there are 10 on the server (the server capacity). Players may coordinate play for other times and are limited only by the server capacity. \n\nRequirements: This class is geared towards experienced Minecraft players (10 and up) with good verbal and some typing communication skills who enjoy cooperative online play in a survival based realm on Easy Difficulty. Participants should know how to craft, mine resources, build and fight off mobs. A set of headphones with a microphone is required to reduce background noise in group voice chat.\n\nCommunication: Voice chat will take place on a CIRCLE Milwaukee Discord server. Please arrange a time with Sara in the days before the class to set-up your discord and connect Minecraft accounts prior to the start of class. We prefer not to take class/session time to do this. If you have not participated before, please log in at least 20 minutes early on the first day. All participants’ parents may listen in to \"supervise\".\n\nNo-call, no-show will be strictly enforced per Circle policies because of the high demand of this class. We will have a wait list. \n\nFriday Session Dates: 9/8, 9/22, 9/29, 10/6, 10/13, 10/20, 10/27, 11/3, 11/10, 11/17, 11/24 ( no moderated class 9/15, but participants may still play)","displayLocation":"Discord/Minecraft, Online","date":"2023-09-08T00:00:00.000Z","startTime":"1899-12-30T15:00:00.000Z","endTime":"1899-12-30T17:00:00.000Z","repeats":"9/8, 9/22, 9/29, 10/6, 10/13, 10/20, 10/27, 11/3, 11/10, 11/17, 11/24","classMinimum":2,"classMaximum":8,"fee":"none","supplies":"A PC or Tablet with the Bedrock version of Minecraft and Discord app downloaded. A set of headphones with a microphone. (please note: realms don't work with Java Edition)"},{"classTitle":"Cosplay Makers Club Tween/Teen","classDescription":"Does your tween/teen like to make costumes and dress up in their own creations? Or do they want to? This group will be teen-led and adult facilitated. Four sessions will be for planning, sourcing, refining and then wearing their creation! * Please note the locations vary for each class.*\n\nThis class is aimed at students who have some inclination of creating cosplay. Students may have some sewing or crafting experience OR be excited to learn. Younger siblings are welcome to attend, please bring a library-appropriate activity to do, or feel free to wander in the library during class time for the first and third classes. Younger siblings may also participate at their level with parental assistance, but do not count towards “participant” count. \n\n9/8 – Location: Wauwatosa Library, Firefly Conference Room\n– Planning: We will have some examples of project boards and collecting project ideas, and color swatches. We will review some ideas of upcycling and creative sourcing for materials. We will briefly discuss budgeting for your idea. Time will be allowed for brainstorming and planning. Kids with sketching skills may help those who want someone else to draw out their ideas or descriptions. Participants will help each other with formulatitudeing ideas and planning. \n– Supplies: Bring drawing paper or a notebook, writing instruments, any pictures or other things that represent an idea you might have for a cosplay. Any materials you may have already started (optional)\n\n\n9/29– Location Goodwill 18605 W Bluemound, Brookfield\n– Sourcing: Goodwill Meet-up for sourcing upcycled materials. Wander the racks with your cosplay idea in mind and help each other find pieces to fit your vision. Attendance for this date is not required, but notification if you don’t plan to attend is required. \n– Supplies: a budget for your project, your costume idea in mind or on paper\n\n\n10/13 - Location: Wauwatosa Library, Firefly Conference Room\n–Refining: Mid-project meet-up. Bring what you have so far. Get help and refine ideas. Sewing and altering help will be available. We will discuss challenges we have run into and brainstorm solutions. Share resources. Some instruction on costume makeup and face painting will be available, and students may practice with face paint (with parental consent.)\n– Supplies: your project as-is so far, materials you want help with, your project planning board/binder/book, face paint and/or costume makeup for your project (optional)\n\n10/27 Location: TBA (Wauwatosa/Brookfield)\n– Show and Tell: Wear what you made for an outing. Costumes need not be fully complete. Some cosplay can take months to refine and take shape. This is just the beginning! The participants will have the option to talk about their creation and describe challenges or something they learned, or what they hope to do next. Presentations are optional and can vary from a short statement to a presentation not exceeding 2 minutes. We will meet somewhere that you will have the option to purchase drinks or food, but it wil not be required.","displayLocation":"Varies. 9/8 - Wauwatosa Library, Firefly Conference Room. 7635 W North Ave, Wauwatosa, WI 53213. 9/29 - Goodwill 18605 W Bluemound, Brookfield. 10/13 - Wauwatosa Library, Firefly Conference Room. 7635 W North Ave, Wauwatosa, WI 53213. 10/27 - TBA (Wauwatosa or Brookfield area).","address":"7635 W North Ave, Wauwatosa, WI 53213","date":"2023-09-08T00:00:00.000Z","startTime":"1899-12-30T11:00:00.000Z","endTime":"1899-12-30T13:00:00.000Z","repeats":"9/29, 10/13, 10/27","classMinimum":2,"classMaximum":10,"fee":"none","supplies":"Varies. See class description for each session.","latitude":"43.06065978490761","longitude":"-88.00809176591339"},{"classTitle":"TEEN/TWEEN Madlibs/Pictionary Contest","classDescription":"Have you ever wondered what some of your funniest Mad Libs creations would look like if they were illustrated? What if you then gave that illustration to someone else and had them try to guess what words you picked based on the drawings? This is how Mad Libs/Pictionary works except we will play in teams to see whose guesses come up with the most hilarious responses. No artistic skills required, poorly drawn pictures lead to more fun! Younger siblings and parents can enjoy the library. We will go for ice cream or a treat in Drexel Town Square afterward for those who want to stay and join us. We will hold this class 3 times (9/13, 10/23, 11/29) but they are independent events so sign up for each individually.","displayLocation":"Oak Creek Library, 8040 S 6th St, Oak Creek, WI 53154","address":"8040 S 6th St, Oak Creek, WI 53154","date":"2023-09-13T00:00:00.000Z","startTime":"1899-12-30T13:00:00.000Z","endTime":"1899-12-30T15:00:00.000Z","repeats":"No","classMinimum":"Min 4","classMaximum":"Max 12","fee":"None","supplies":"None","latitude":"42.8984388","longitude":"-87.9177719"},{"classTitle":"Dish it Up!","classDescription":"We will meet at Ridge Run Park and make simple, but functional dishes out of clay. This one is for all ages, so moms & dads are encouraged to sign up and participate too.\n\nAges 4+ (Children 3 and under may participate if they won't put clay or tools in their mouths. Parents should monitor young children.)\n\nItems will be glazed and fired after the class and available latitudeer in the fall.","displayLocation":"Ridge Run Park East, 300 S University Dr, West Bend, WI 53095","address":"300 S University Dr, West Bend, WI 53095","date":"2023-09-14T00:00:00.000Z","startTime":"1899-12-30T10:30:00.000Z","endTime":"1899-12-30T12:00:00.000Z","repeats":"No","classMinimum":"No minimum","classMaximum":"10 students","fee":"$5/participant","supplies":"Feel free to bring along any interesting objects, fabrics, botanicals, etc. that you might use to create texture in clay. Please note, they will get clay on them, and delicate items or botanicals likely will not be salvageable.","latitude":"43.420579","longitude":"-88.211197"},{"classTitle":"Lego League","classDescription":"CIRCLE Lego League is based loosely around the FIRST Lego League structure. We will be working in teams over the course of the session to solve problems and build lego models to display our solutions to these problems. \n\nStudents will learn about lego building strategies, discuss individual builds with their teammates, and work together toward a finale build that will be presented to all the teams at our final meeting. \n\nWhile FIRST Lego League incorporates coding/robotics, this class series will focus solely on traditional lego building and collaborations. This class will be geared toward students 6-12 (but all lego fans are welcome). I will try and place students in teams with students of similar experience levels. Younger siblings are welcome to attend (at no cost) and I will have loose lego and/or duplo available for them to build.","displayLocation":"Jackson Community Center, N165W20330 Hickory Ln, Jackson, WI 53037","address":"N165W20330 Hickory Ln, Jackson, WI 53037","latitude":"43.31992023897151", "longitude":"-88.16112473891079","date":"2023-09-15T00:00:00.000Z","startTime":"1899-12-30T10:30:00.000Z","endTime":"1899-12-30T12:00:00.000Z","repeats":"Yes","classMinimum":"10 students","classMaximum":"20 students","fee":"$10/student","supplies":"None"},{"classTitle":"Book/Supply Swap","classDescription":"This is an all-genres-welcomed party! Feel free to bring educational materials, curriculums, chapter books, school supplies, and more! We will be running this as a “free-for-all” so please take whatever amount you brought in. Example: You bring 3 chapter books and 2 spiral notebooks, please only take 5 items. If there are items left over after the swap, feel free to either take home the items you brought or they will be donated to the Germantown Library.","displayLocation":"Menomonee Park Beach - we can meet at the playground picnic tables and if the weather is inclement, we can move to the covered portion of the beach house (W220 N7884 Town Line Rd, Menomonee Falls, WI 53051)","address":"W220 N7884 Town Line Rd, Menomonee Falls, WI 53051","latitude":"43.15806769129542","longitude":" -88.1733834391475","date":"2023-09-15T00:00:00.000Z","startTime":"1899-12-30T10:00:00.000Z","endTime":"1899-12-30T12:00:00.000Z","repeats":"No","classMinimum":"No minimum","classMaximum":"No maximum","fee":"$6 daily permit to enter the park, which can be purchased directly online *Have your license platitudee information handy; you’ll enter it at time of purchase.","supplies":"N/A"},{"classTitle":"STEAM Club","classDescription":"Science \nTechnology \nEngineering \nArt \nMath\n\nBringing together these creative engines of modern technical culture, we will explore concepts and ideas through projects, experiments and play. Activities will vary depending upon age and interest of attendees, but we will seek to find ways for everyone to connect with concepts discussed. \n\nAges 5+","displayLocation":"Ridge Run Park, 300 S. University Dr, West Bend, WI 53095","address":"300 S University Dr, West Bend, WI 53095","date":"2023-09-20T00:00:00.000Z","startTime":"1899-12-30T10:30:00.000Z","endTime":"1899-12-30T12:00:00.000Z","repeats":"No","classMinimum":"No Minimum","classMaximum":"10 students","fee":"$1/student","supplies":"None","latitude":"43.420579","longitude":"-88.211197"},{"classTitle":"Kohler Andre Through the Seasons","classDescription":"Join us to explore the beach at Kohler Andre from month to month throughout the year. We'll observe and take note of the features of the beach, the waves, the wind, the water temperature, the water level, and some of the plants on the dunes. After making our observations we'll spend time rock collecting, building sandcastles, sculpting with beach clay, or whatever your favorite seasonal beach pastime may be.\nBring a notebook and drawing supplies if you'd like to journal the changes in the beach through the seasons.\n\nDress for the weather. Depending on the day it can be significantly cooler (or warmer) than further inland, so layers are recommended. Waterproof boots or water shoes are recommended.\n\nAttend all meetups, or attend one, just let us know which ones you'll be attending in your sign-up.","displayLocation":"Kohler Andre State Park Sanderling Nature Center","address":"1020 Beach Park Ln, Sheboygan, WI 53081","date":"2023-09-20T00:00:00.000Z","startTime":"1899-12-30T15:00:00.000Z","endTime":"1899-12-30T16:00:00.000Z","repeats":"10/18, 11/29","classMinimum":2,"classMaximum":25,"fee":0,"supplies":"None","latitude":"43.66800375","longitude":"-87.72105578355146"},{"classTitle":"Tween/Teen September STEM Challenge","classDescription":"Tween/ Teen STEM Challenge- build a spaghetti tower using specifications and supplies shared at the event.\nAND for all ages, I'll provide supplies to free build with spaghetti & mini marshmallows.\n\nThis activity is being set up with the tween/teen crowd in mind, but I'll can be easily modified for younger siblings. After the build portion, my kids (ages 10 & 13) will stick around for free play. \n\nThe location is TBD and will be updated before the editing window is closed.","displayLocation":"TBD","date":"2023-09-22T00:00:00.000Z","startTime":"1899-12-30T13:00:00.000Z","endTime":"1899-12-30T15:00:00.000Z","repeats":"No","classMinimum":5,"classMaximum":20,"fee":"$1.50/student","supplies":"None"},{"classTitle":"Tinder/Kinding Bundles","classDescription":"We'll be making tinder bundles to use as fire starters. \nIt's a really simple process that uses up the dead weeds from your yard and you can use throughout the year to help quickly start a fire. \nEach participant should try to bring some materials - for this we want old dead plant material that is somewhat woody (so that it'll last and will burn when ready to use), but isn't too thick or difficult to bend (so that we can bundle it). You can also bring things to wedge inside the bundles, such as very small dry pinecones or dryer lint. \nI'll supply the twine to tie the bundles together at the end. \n\nWe will meet at the fire pit at Glacier Hills County Park, near the playground. A Washington County Parks Pass is required.","displayLocation":"Glacier Hills County Park, 1664 Friess Lake Rd, Hubertus, WI 53033","address":"1664 Friess Lake Rd, Hubertus, WI 53033","latitude":"43.24976973235715","longitude":"-88.29148539580079","date":"2023-09-25T00:00:00.000Z","startTime":"1899-12-30T14:45:00.000Z","endTime":"1899-12-30T15:30:00.000Z","repeats":"No","classMinimum":"No minimum","classMaximum":"No maximum","fee":"None","supplies":"Dead woody plant material"},{"classTitle":"TWEEN/TEEN Yearbook Club","classDescription":"Let's create a yearbook with our CIRCLE friends! We will get together once a month during the 2023-2024 \"school-year\" to coordinate and plan creating a communal yearbook. The tweens and teens who join the club will be in charge of collecting digital photos, dividing pages among club members, and then creating the pages they have committed to. We will mostly communicate on-line but the monthly check-in meetings will be over lunch at the 3rd Street Market Hall in Milwaukee. The project will be monitored by parents but led by the tween/teens. At the end of the \"school-year\" CIRCLE members will be able to order copies of the yearbook. This \"class\" will repeat each month but if you can't make each networking/check-in lunch that's okay since the majority of the work will be done on-line.","displayLocation":"3rd Street Market Hall, 275 W Wisconsin Ave Milwaukee, WI 53203","address":"275 W Wisconsin Ave Milwaukee, WI 53203","date":"2023-09-26T00:00:00.000Z","startTime":"1899-12-30T11:30:00.000Z","endTime":"1899-12-30T13:30:00.000Z","repeats":"10/24/2023, 11/21/23","classMinimum":"Min 6","classMaximum":"None","fee":"None","supplies":"None","latitude":"43.0383611","longitude":"-87.9146169"},{"classTitle":"Pokemon Card Game","classDescription":"Come play Pokemon cards with others, trade, or just talk about their cool abilities.\n\nThis will be kid led as I know very little compared to my five year old! We will do this once in September and once in November.","displayLocation":"Brookfield Library (1900 N Calhoun Rd, Brookfield)","address":"1900 N Calhoun Rd, Brookfield, WI","date":"2023-09-27T00:00:00.000Z","startTime":"1899-12-30T10:00:00.000Z","endTime":"1899-12-30T11:00:00.000Z","repeats":"No","classMinimum":2,"classMaximum":15,"fee":"None","supplies":"Pokemon Cards","latitude":"43.05565150184096","longitude":"-88.1260652499721"},{"classTitle":"Circle Chess Club Live Play","classDescription":"Meet us at the park for live chess play!\n\nWe will meet at 10am at the pavilion at Ridge Run Park (enter the park on University Drive and follow the driveway past the first play area/exercise equipment and down to the parking lot by the second playground. We will be at tables under one of the open air pavilions). \n\nPlease bring your own chess board if possible!\n\nSiblings welcome. There is a play structure and hiking trails that can be used as well. \n\nWe will plan to have chess games going for about an hour (give or take). \n\nHope to see you there!","displayLocation":"Ridge Run Park, 300 S University Drive, West Bend, WI","address":"300 S University Dr, West Bend, WI 53095","date":"2023-09-29T00:00:00.000Z","startTime":"1899-12-30T10:00:00.000Z","endTime":"1899-12-30T11:30:00.000Z","repeats":"No","classMinimum":"3 families","classMaximum":"None","fee":"None","supplies":"Bring a chess board","latitude":"43.420579","longitude":"-88.211197"},{"classTitle":"Beginner Archery","classDescription":"Learn basic archery skills and practice in a 15,000 sq foot indoor range. The staff of Buck Rub will provide a short 15 minute intro class on safety and use of the equipment and students will then use the remaining time to practice their skills. \n\nThis class will be best for ages 8+ but children as young as 5 could be appropriate if you feel confident they have the upper body strength and coordination to manage a bow and arrow, as well as the safety awareness to shoot around other people and wait until all others are done shooting to enter the range. \n\nThe cost of rental and range time is $9/student and a $20 lesson fee will be split evenly amongst the participants so final cost will depend on the number of participants.","displayLocation":"Buck Rub Outfitters N13 W28400 Silvernail Rd, Pewaukee, WI 53072","latitude":"43.05011936806138", "longitude":"-88.3137763369979","address":"N13 W28400 Silvernail Rd, Pewaukee, WI 53072","date":"2023-10-06T00:00:00.000Z","startTime":"1899-12-30T10:30:00.000Z","endTime":"1899-12-30T11:30:00.000Z","repeats":"No","classMinimum":"Minimum 6 participants","classMaximum":"Maximum 14 participants","fee":"$9/ student plus the cost of the lesson which will be $20 divided by number of total participants.","supplies":"None"},{"classTitle":"Finger painting with Delaney","classDescription":"Come fingerprint fall trees with Delaney! Prepare to get messy as we explore the textures of paint and canvas. We will also explore what happens to trees when seasons change. Wear clothes that can get messy or bring a smock. This class is geared towards ages 4-9.","displayLocation":"10543 Beacon Hill Ct E, Franklin, WI 53132","address":"10543 Beacon Hill Ct E, Franklin, WI 53132","date":"2023-10-06T00:00:00.000Z","startTime":"1899-12-30T10:00:00.000Z","endTime":"1899-12-30T11:00:00.000Z","repeats":"No","classMinimum":2,"classMaximum":4,"fee":"$3/child","supplies":"Smock to cover clothing or clothes that can get messy.","latitude":"42.8972715","longitude":"-88.04631313068805"},{"classTitle":"Trick or Treat Feral Kids Camping Edition","classDescription":"*This class is being held during the fall feral kids camping.\nHave fun trick or treating at Pike lake campground. Campers who choose to participate can decorate their trunks or campsite, or just pass out a fun treat. Costumes are always fun, but not required. Please remember to follow all Circle rules with costumes and decorations. Participating campers will be marked, so the kids know whose sites they can visit. Families with food allergies or dietary restrictions are responsible for monitoring their child's treats.","displayLocation":"Pike lake campground. 3544 Kettle Moraine Rd, Hartford, WI 53027","address":"3544 Kettle Moraine Rd, Hartford, WI 53027","date":"2023-10-10T00:00:00.000Z","startTime":"1899-12-30T17:30:00.000Z","endTime":"1899-12-30T19:00:00.000Z","repeats":"No","classMinimum":"10 participants","classMaximum":"None","fee":"None","supplies":"Any decorations or costumes you choose. Treats to pass out.","latitude":"43.3195461","longitude":"-88.3190674"},{"classTitle":"MNO Board Games October","classDescription":"Moms like board games too! Come to play board games with your Circle mom-friends. We will each bring a game and see what everyone wants to play. Bring a game you like and a snack or drink to share. \n\nAddress is 2454 N 7th Street, back house, Milwaukee\n\nDates 10/14, 11/18 *sign up for each session separately*\n4-8(ish) pm \n\nCo-hosted: Sara Raynor, Sarah Staplekamp","displayLocation":"2454 N 7th Street, back house, Milwaukee","address":"2454 N 7th Street, Milwaukee, WI","date":"2023-10-14T00:00:00.000Z","startTime":"1899-12-30T16:00:00.000Z","endTime":"1899-12-30T20:00:00.000Z","repeats":"sessions listed separately","classMinimum":2,"classMaximum":8,"fee":"none","supplies":"snack or drink to share, your favorite board game (optional)","latitude":"43.0634106","longitude":"-87.91966283697083"},{"classTitle":"Tween/Teen: Radio Milwaukee Shadow Day & State of Sounds","classDescription":"Participate in a half day shadow opportunity at independent radio stations, Radio Milwaukee / 88Nine / HYFIN. Shadow opportunities offer young people an immersive and interactive look into a day in the life of a Radio Milwaukee team member. \n\nHere's an anticipated schedule of the day: \n\n2pm Arrival + tour begins \n- Students have the opportunity to talk to staff across multiple departments about their responsibilities and vocational journey \n3pm DJ time with Marcus Doucette\n- Sit in with one of 88Nine or HYFIN's on-air personalities for a portion of their shift \n3:45-4:00pm Chill out \n- Students regroup and have 15 minutes to use the restroom, rest, or ask questions \n4:00pm Music Meeting \n- Students gather in our conference room to listen to songs that have our team split. They will break the tie and decide what songs are 88Nine and HYFIN material.\n5:00pm Doors open for State of Sound \n- Students come downstairs to take their seats for State of Sound \n6:00pm Students depart \n\nDue to the size limitations of the group please anticipate dropping off your t(w)een for this experience to give as many spots to interested t(w)eens as possible. The class organizer will be on-site. \n\nColectivo Coffee at the Foundry (170 S 1st St, Milwaukee, WI 53204) is a block away from Radio Milwaukee and may be a good place to hang out while waiting for your t(w)een as well as exploring the Third Ward or 2nd St with or without siblings. Feel free to check in during the 3:45pm break and come for the State of Sound show at 5pm.","displayLocation":"Radio Milwaukee 220 E. Pittsburgh Ave. Milwaukee, WI 53204","address":"220 E. Pittsburgh Ave. Milwaukee, WI 53204","date":"2023-10-19T00:00:00.000Z","startTime":"1899-12-30T14:00:00.000Z","endTime":"1899-12-30T18:00:00.000Z","repeats":"No","classMinimum":2,"classMaximum":"17 students","fee":"None","supplies":"Please wear clean clothing that isn't pajamas. It doesn't need to be business casual, just not the typical \"homeschool uniform.\"","latitude":"43.0296831","longitude":"-87.90933414844186"},{"classTitle":"Tween/ Teen October STEM Challenge","classDescription":"Tween/ Teen STEM Challenge- zombie zip line & parachute drop\n\nDesign, build & decorate a zombie (or cat or bat or whatever inspires you) with recyclable materials and then send it down the zip line or drop it vertically to beat the best time. \n\nThis activity is being set up with the tween/teen crowd in mind, but I'll can be easily modified for younger siblings. After the build portion, my kids (ages 10 & 13) will stick around for free play. \n\nThe location is TBD and will be updated before the editing window is closed.","displayLocation":"TBD","date":"2023-10-20T00:00:00.000Z","startTime":"1899-12-30T13:00:00.000Z","endTime":"1899-12-30T15:00:00.000Z","repeats":"No","classMinimum":5,"classMaximum":20,"fee":"$2/student","supplies":"None"},{"classTitle":"TEEN/TWEEN Madlibs/Pictionary Contest","classDescription":"Have you ever wondered what some of your funniest Mad Libs creations would look like if they were illustrated? What if you then gave that illustration to someone else and had them try to guess what words you picked based on the drawings? This is how Mad Libs/Pictionary works except we will play in teams to see whose guesses come up with the most hilarious responses. No artistic skills required, poorly drawn pictures lead to more fun! Younger siblings and parents can enjoy the library. We will go for ice cream or a treat in Drexel Town Square afterward for those who want to stay and join us. We will hold this class 3 times (9/13, 10/23, 11/29) but they are independent events so sign up for each individually.","displayLocation":"Oak Creek Library, 8040 S 6th St, Oak Creek, WI 53154","address":"8040 S 6th St, Oak Creek, WI 53154","date":"2023-10-23T00:00:00.000Z","startTime":"1899-12-30T13:00:00.000Z","endTime":"1899-12-30T15:00:00.000Z","repeats":"No","classMinimum":"Min 4","classMaximum":"Max 12","fee":"None","supplies":"None","latitude":"42.8984388","longitude":"-87.9177719"},{"classTitle":"What is Día de Muertos?","classDescription":"Día de Muertos isn't another Halloween; it's a Mexican holiday rich with tradition. We'll learn about Day of the Dead at Humboldt Park.\n\nWhile the focus of the class will be learning about the holiday and its traditions, you're also welcome to bring pictures or mementos of a loved one who has passed away. Feel free to share some fun, heartwarming or funny stories about them in a light and joyous way.\n\nOur hope is that Jason Gonzales will host the Bay View Community Ofrenda again, and after our class you can visit it and display your picture(s) there, if you'd like. Last year, there were plastic sleeves that you could slip your photo into before clipping them to the ofrenda. For context, we brought one photo in particular to display along with marigolds for each of our other deceased loved ones who we wanted to honor and remember.\n\nWhile death will clearly be discussed, the tone of the class will be warm, not somber, in the spirit of the holiday.","displayLocation":"Humboldt Park","address":"3000 S Howell Ave, Milwaukee, WI 53207","date":"2023-10-23T00:00:00.000Z","startTime":"1899-12-30T16:00:00.000Z","endTime":"1899-12-30T17:30:00.000Z","repeats":"No","classMinimum":"6 attendees","classMaximum":"20 attendees","fee":"n/a","supplies":"Printed photos of your deceased loved ones and/or marigolds if you'd like to attend the community ofrenda after class (providing it's there again this year): https://onmilwaukee.com/articles/bay-view-ofrenda\n\nYou're also welcome to share a photo during our class.","latitude":"42.9907746","longitude":"-87.901148"},{"classTitle":"“Spook-cuterie” aka Halloween Grazing box","classDescription":"Class Description: Let’s get in the latitudeest craze that has adapted over the years. Whether you call it a relish tray, cheese and cracker tray, fruit and veggie, tasting board, snack tray, smorgasbord, or the latitudeest term charcuterie let’s do it together. We will be doing a fall theme and a twist on the popular board by using boxes! I will supply various foods to be combined in your own take home box. \n\n*Please let me know if there are any allergies.\n\nClass Fees: $10/kid(box)\nClass Min: 5\nClass Max: 30\n\nClass Coordinator: Samantha Jeske\nEmail: sweetiepie287@hotmail.com\nPhone: 414-640-7603","displayLocation":"Miniwaukan Park, 360 McKenzie Dr., Mukwonago, WI","latitude":"42.859623828649234", "longitude":"-88.3245782884523","address":"360 McKenzie Dr., Mukwonago, WI","date":"2023-10-23T00:00:00.000Z","startTime":"1899-12-30T10:00:00.000Z","endTime":"1899-12-30T11:00:00.000Z","repeats":"No","classMinimum":"5 kids/boxes","classMaximum":"30 kids/boxes","fee":"$10 kid/box","supplies":"None"},{"classTitle":"Teen Campfire","classDescription":"Hang out with other homeschool teens at a backyard campfire! Roast marshmallows and enjoy some hot cocoa. This event is for teens ages 12 and older only. Parents are welcome to stay. If it's cold, we'll bundle up. If it's raining, we'll cancel.","displayLocation":"7319 W Pineberry Ridge, Franklin WI 53132","address":"7319 W Pineberry Ridge, Franklin WI 53132","date":"2023-10-26T00:00:00.000Z","startTime":"1899-12-30T19:00:00.000Z","endTime":"1899-12-30T21:00:00.000Z","repeats":"No","classMinimum":5,"classMaximum":10,"fee":"n/a","supplies":"Dress warm!","latitude":"42.9036431","longitude":"-88.00594668791334"},{"classTitle":"Mo Willems Storytime","classDescription":"Join CIRCLE friends at the Oak Creek Public Library to listen to a variety of short stories by Mo Willems featuring Elephant & Piggy. We will discuss the stories as they are read aloud and answer some comprehension questions that arise.\n\nRelax while you color Elephant & Piggy pages that will also be available to enjoy.\n\nDon't forget to grab a delicious, seasonal, organic apple for a snack on your way home. (No food is allowed in the library, so please take it with you.) \n\nAlso, each family will receive their very own copy of \"A Very Busy Creature's Day Eating!\"\n\nThis class will best be suited for children ages 2-7 years old, anyone young at heart, or Mo Willem fans.","displayLocation":"Oak Creek Public Library 8040 S 6th St, Oak Creek, WI 53154","address":"8040 S 6th St, Oak Creek, WI 53154","date":"2023-10-30T00:00:00.000Z","startTime":"1899-12-30T12:30:00.000Z","endTime":"1899-12-30T14:00:00.000Z","repeats":"No","classMinimum":"3 students","classMaximum":"8 students","fee":1,"supplies":"none","latitude":"42.8984388","longitude":"-87.9177719"},{"classTitle":"Mystery Science Class","classDescription":"Mystery Science is an engaging multimedia science curriculum based on NGSS standards. They have given me permission to use their program with Circle Coop. This class is for elementary and early middle school kids. Kids who sign up will have a chance to vote on the topic we cover.","displayLocation":"https://meet.google.com/mxy-qqoc-wbx","date":"2023-11-01T00:00:00.000Z","startTime":"1899-12-30T10:00:00.000Z","endTime":"1899-12-30T11:00:00.000Z","repeats":"No","classMinimum":5,"classMaximum":12,"fee":"None","supplies":"Basic supplies from around the house"},{"classTitle":"Pokemon Card Game","classDescription":"Come play Pokemon cards with others, trade, or just talk about their cool abilities.\n\nThis will be kid led as I know very little compared to my five year old! We will do this once in September and once in November.","displayLocation":"Brookfield Library (1900 N Calhoun Rd, Brookfield)","address":"1900 N Calhoun Rd, Brookfield","date":"2023-11-03T00:00:00.000Z","startTime":"1899-12-30T10:00:00.000Z","endTime":"1899-12-30T11:00:00.000Z","repeats":"No","classMinimum":2,"classMaximum":15,"fee":"None","supplies":"Pokemon Cards","latitude":"43.05565150184096","longitude":"-88.1260652499721"},{"classTitle":"Ninja Gym Tosa","classDescription":"Join us for an hour of Ninja Gym fun! Activities could include: obstacle course, climbing wall, rings, swings, monkey bars, THE WALL, and pumping tunes. \n\nNote that due to the size of the obstacles, this class is best suited for kids about age 4-11. Last time I was there they had a small room available for our youngest kiddos. Please not in your sign-up if you are bringing along younger siblings so I can let the staff at Legacy Gym know. \n\nLegacy Gym is a functional fitness gym owned by Brit, a 3 season participant of \"American Ninja Warrior\". The gym is meant for people from all walks of life to come together and connect through fitness, good times, and positive energy. \n\nThere is street parking along Underwood, or a parking garage. Please plan accordingly for a timely arrival so you don't miss the opening safety info. Also, to help save time, please fill out this online waiver ahead of class: https://app.waiverelectronic.com/render/templatitudeeByRefId/62a1f13fe21b732e259cb402","displayLocation":"Legacy Gym Tosa, 1535 Underwood Ave, Wauwatosa WI 53213","address":"1535 Underwood Ave, Wauwatosa WI 53213","date":"2023-11-03T00:00:00.000Z","startTime":"1899-12-30T13:30:00.000Z","endTime":"1899-12-30T14:30:00.000Z","repeats":"No","classMinimum":10,"classMaximum":18,"fee":"$7/student","supplies":"Shoes, Water, Movement Enabling Attire, Courage, Endurance. Online waiver filled out ahead of class.","latitude":"43.0510065","longitude":"-88.0086951"},{"classTitle":"Sunset painting with Delaney","classDescription":"Capture the beauty of a sunset on canvas! Delaney will walk you through the colors of sunsets and the process of painting one. We will explore why sunsets look the way they do. Please wear clothes that can get messy. This class is best for ages 10 and up.","displayLocation":"10543 Beacon Hill Ct E, Franklin, WI 53132","address":"10543 Beacon Hill Ct E, Franklin, WI 53132","date":"2023-11-03T00:00:00.000Z","startTime":"1899-12-30T13:00:00.000Z","endTime":"1899-12-30T14:00:00.000Z","repeats":"No","classMinimum":"2 students","classMaximum":"4 students","fee":"$3/student","supplies":"Clothes that can get messy","latitude":"42.8972715","longitude":"-88.04631313068805"},{"classTitle":"Become a Dog-Body-Language Detective! Dog-Bite Prevention Presentation & Workshop","classDescription":"Dogs are amazing animals and have the potential to bring an abundance of joy into people's lives!! Most dogs are also very strong, fast, and have extremely powerful jaws!! Since dogs are such a popular pet in our communities it's really important for people (owners and non-owners) to make the time to learn more about dogs as a species and how they communicate. Dogs don't have a spoken language like we do, however they do have rich emotional lives, and they often \"wear their emotions on their sleeve\". Almost every single body part on a dog has a story to tell! All we have to do is pay close attention and look for clues to tell us how they're feeling. Please join us for a presentation and workshop on reading canine body language to reduce the chances of your kids or you being bit, and to set yourself and your family up for safer, more enjoyable interactions with willing dogs!! Class is geared toward school-aged kids but all people will benefit. (FYI: No live dogs are permitted at this location.)\n\nAmy was a Certified Professional Dog Trainer and trained/taught at the Wisconsin Humane Society and private practice for 10 years, and completed an apprenticeship and post-baccalaureate academic program in humane, science-based dog behavior and training/psychology. She has been a guardian and trainer to many dogs and one pot-bellied pig/wild boar hybrid.","displayLocation":"Waukesha Public Library, 321 Wisconsin Ave, Waukesha, WI 53186","address":"321 Wisconsin Ave, Waukesha, WI 53186","date":"2023-11-04T00:00:00.000Z","startTime":"1899-12-30T13:30:00.000Z","endTime":"1899-12-30T15:30:00.000Z","repeats":"No","classMinimum":"40 attendees (children plus adults)","classMaximum":"96 attendees (children plus adults)","fee":"None collected by CIRCLE. A small donation of about $1-5 per family may be requested at the time of class to cover the cost of class materials and handouts.","supplies":"None","latitude":"43.0856245","longitude":"-88.26599435714286"},{"classTitle":"The Garcade","classDescription":"Spend the afternoon at the arcade! The Garcade is a locally owned arcade, filled with almost 200 games. We will be getting a discounted group rate, and you can come and go all day/night with your wristband. We had such an amazing turn out in Spring. We look forward to seeing everyone again this time around.","displayLocation":"N85W15920 Appleton Ave, Menomonee Falls, WI 53051","latitude":"43.17303375586795", "longitude":"-88.10785536426147","address":"N85W15920 Appleton Ave, Menomonee Falls, WI 53051","date":"2023-11-10T00:00:00.000Z","startTime":"1899-12-30T12:00:00.000Z","endTime":"1899-12-30T14:00:00.000Z","repeats":"No","classMinimum":"10 participants","classMaximum":"None","fee":"$15 per person. Everyone on the arcade floor must pay for a wristband.","supplies":"Outside food and drinks are not allowed in the arcade. They do have some items available for purchase. But you can easily come and go for water and snack breaks."},{"classTitle":"MNO Board Games November","classDescription":"Moms like board games too! Come to play board games with your Circle mom-friends. We will each bring a game and see what everyone wants to play. Bring a game you like and a snack or drink to share. \n\nAddress is 2454 N 7th Street, back house, Milwaukee\n\nDates 10/14, 11/18 *sign up for each session separately*\n4-8ish pm\n\nCo-hosted: Sara Raynor, Sarah Staplekamp","displayLocation":"2454 N 7th Street, back house, Milwaukee","address":"2454 N 7th Street, Milwaukee, WI","date":"2023-11-18T00:00:00.000Z","startTime":"1899-12-30T16:00:00.000Z","endTime":"1899-12-30T20:00:00.000Z","repeats":"multiple sessions submitted separately","classMinimum":2,"classMaximum":8,"fee":"none","supplies":"Snack or drink to share, your favorite board game (optional)","latitude":"43.0634106","longitude":"-87.91966283697083"},{"classTitle":"Granny Square Swap (Tween/Teen/Adult)","classDescription":"Do you love granny squares? \n\nCreate granny squares this fall, then swap your completed granny squares with friends! \n\nYou can use your new squares to start a friendship blanket, scarf, or other fun creations.\n\nYour squares can be any color/theme (within Circle guidelines). The only guidelines are to create 6 inch squares using worsted weight yarn. This will make joining the squares easier.\n\nThis swap is for tweens, teens, and adults. Once we have a number of people in the swap we'll determine an amount of granny squares, not to exceed 20.\n\nWe will meet at Blum, but may change to the library if the class size is too large.\n\nIf you can't make the swap date, no worries! Give me your squares ahead of time and I will \nshare them at the meetup for you and gather your new squares.\n\nIf this session goes well, we will do it again over winter to grow our friendship creations!","displayLocation":"Blum Coffee Garden 4930 W Loomis Rd, Greenfield, WI 53220","date":"2023-11-29T00:00:00.000Z","startTime":"1899-12-30T13:00:00.000Z","endTime":"1899-12-30T14:00:00.000Z","repeats":"No","classMinimum":"5 participants","classMaximum":"18 participants","fee":"None","supplies":"Completed Granny Squares"},{"classTitle":"TEEN/TWEEN Madlibs/Pictionary Contest","classDescription":"Have you ever wondered what some of your funniest Mad Libs creations would look like if they were illustrated? What if you then gave that illustration to someone else and had them try to guess what words you picked based on the drawings? This is how Mad Libs/Pictionary works except we will play in teams to see whose guesses come up with the most hilarious responses. No artistic skills required, poorly drawn pictures lead to more fun! Younger siblings and parents can enjoy the library. We will go for ice cream or a treat in Drexel Town Square afterward for those who want to stay and join us. We will hold this class 3 times (9/13, 10/23, 11/29) but they are independent events so sign up for each individually.","displayLocation":"Oak Creek Library, 8040 S 6th St, Oak Creek, WI 53154","address":"8040 S 6th St, Oak Creek, WI 53154","date":"2023-11-29T00:00:00.000Z","startTime":"1899-12-30T13:00:00.000Z","endTime":"1899-12-30T15:00:00.000Z","repeats":"No","classMinimum":"Min 4","classMaximum":"Max 12","fee":"None","supplies":"None","latitude":"42.8984388","longitude":"-87.9177719"},{"classTitle":"Legoland Field Trip","classDescription":"Everything is AWESOME! Join us for a field trip to the LEGOLAND Discovery Center. Students can enjoy 10 LEGO play zones, an interactive ride, a 4D Cinema and more! \n\nAs a field trip, our group has the option to add-on a 30-45 minute age-appropriate workshop, which incorporates LEGO Education lessons to create a unique curriculum-linked STEAM learning experience in a hands-on environment. The add-on component will be based on our final class numbers and interest. Add on classes are $5 per student. \n\nPlease note: Legoland is in Schaumburg, Illinois. All families should plan to arrive early/promptly. Our group cannot enter separately. There is no food allowed inside the facility. You are allowed to leave for lunch and return.","displayLocation":"601 N Martingale Rd, Schaumburg, IL 60173","address":"601 N Martingale Rd, Schaumburg, IL 60173","date":"2023-11-30T00:00:00.000Z","startTime":"1899-12-30T11:00:00.000Z","endTime":"1899-12-30T16:00:00.000Z","repeats":"No","classMinimum":"10 students","classMaximum":"30 students","fee":"$12 per person. (Children 2 and under are free). $5 per student add-on for extention class.","supplies":"None","latitude":"42.0397786","longitude":"-88.033899"},{"classTitle":"Transcripts, High School, College Credit ... Oh My!","classDescription":"High school is one of the most daunting years and some of the most freeing years of being a home-based private education program administrator (aka homeschool mom or dad). \n\nLet's gather for an early morning video chat of the WI laws surrounding home-based private education programs \"homeschools\" , and some resources for transcript writing, high school planning, and gaining college credit. \n\nThis is geared towards those filing a PI-1206 rather than public schoolers at home (Bridges, RVA, etc), but all are welcome regardless of the ages of your kiddos. \n\nI'll be in my pjs. Video as you are.","displayLocation":"Google Meet","date":"2023-09-01T00:00:00.000Z","startTime":"1899-12-30T08:30:00.000Z","endTime":"1899-12-30T09:30:00.000Z","repeats":"No","classMinimum":"None","classMaximum":"None","fee":"None","supplies":"Internet connection for google meet."},{"classTitle":"A Mom Teaching Other Parents to Knit Session #1","classDescription":"Grab your yarn balls, some pointy stick things, and join me to learn to knit. You've all been asking, and I'm delivering! \n\nThis class is meant for adults who don't know how to knit, or who would like to get better. (If you're an experienced knitter, feel free to join us at the meetups, but don't register. Save the seats for the newbies.) Babes in arms are welcome, but otherwise please leave the kiddos at home. \n\nI will walk you through the whole process from choosing needles and yarn, to casting on and binding off, and all the stitches in between. We will meet 3 times, and I'll be available via text or Marco Polo for help in between.\n\nYou will have 3 options for easy beginner projects, I'll provide the patterns and help you navigate them. Choose from:\n1. Cowl\n2. Scarf\n3. Hat\n\nI put the end time for 7pm because Fiddleheads closes then, but you may leave earlier if you need to.\n\n** This group will be offered in two different sessions, each is 3 classes. Feel free to sign up for just one session, or both. They will be listed separately on the form. **","displayLocation":"Fiddleheads Menomonee Falls, N88 W16621 Appleton Ave, Menomonee Falls, WI 53051","latitude":"43.17785537176631", "longitude":"-88.11644282304182","address":"N88 W16621 Appleton Ave, Menomonee Falls, WI 53051","date":"2023-09-01T00:00:00.000Z","startTime":"1899-12-30T17:30:00.000Z","endTime":"1899-12-30T19:00:00.000Z","repeats":"All the same times, 9/8, 9/22","classMinimum":"2 knitters","classMaximum":"5 knitters","fee":"None, but please consider making a purchase at Fiddleheads since we are using their space.","supplies":"Knitting needles and yarn. I will reach out via email to help you decide what you need based on your planned project."},{"classTitle":"Unsure","classDescription":"Unsure","displayLocation":"Unsure","date":"2023-09-01T00:00:00.000Z","startTime":"1899-12-30T09:00:00.000Z","endTime":"1899-12-30T11:00:00.000Z","repeats":"No","classMinimum":"Unsure","classMaximum":"Unsure","fee":"Unsure","supplies":"Unsure"},{"classTitle":"Learn to Kayak","classDescription":"Have you or your kiddos had interest in kayaking, do you love nature, if so, this is for you! Our wonderful friends at Orenda outdoors will be helping us host a kayaking intro course, followed by a kayaking adventure down the Milwaukee river the following week. Their team is ACA certified and they will provide the Kayaks, paddles and life jackets.\n\nAny age is welcome. The course is 2 hrs long with a break in between. You can bring a lunch and enjoy a picnic by the river.","displayLocation":"277 S Main ST West Bend WI","latitude":"43.4212522633645", "longitude":"-88.18081624762529","address":"277 S Main ST West Bend WI","date":"2023-09-05T00:00:00.000Z","startTime":"1899-12-30T13:00:00.000Z","endTime":"1899-12-30T15:00:00.000Z","repeats":"We have the option to schedule another if there is interest.","classMinimum":2,"classMaximum":12,"fee":"$30 per student.","supplies":"Water shoes are recommended. You may also bring a lunch and water bottle."},{"classTitle":"Terra Trails - Minooka Park","classDescription":"Let’s explore the trails at Minooka Park with this hike & play class! Each week we will walk the trails to find a special spot to explore. We will likely find a favorite spot to revisit a few times during the autumn and we may explore new areas too. Our walks will be relatitudeively short, and we will leave a lot of time for free play at our destination before heading back to our starting point. All ages are welcome, but please note that our walks will prioritize stopping for imaginary play and child-led exploration. \n\nNotes:\n-Terra Trails is open to all ages. \n-We plan to meet at Picnic Area #3. If we make any changes to meeting location, it will be communicated via email.\n-This class is held at the same time as Tween/Teen Hangout so families with multiple ages can offer a class to their younger children at the same time as having older child activities on site. \n-Feel free to pack a snack or lunch. There will be time to eat either as a play break or once we get back to the picnic area at the end of the class.\n-Please dress for the weather.\n-Please check your email before leaving the house for any possible cancellatitudeion notices.\n-Minooka Park is a Waukesha County Park and requires a vehicle entrance permit. Daily ($6) or annual ($35).\n-For the October 31 hike, Halloween costumes are welcomed! \n\nAttendance: While attendance at enrolled events is encouraged, we do not want to discourage anyone from signing up for this class due to its frequency. It is ok to enroll knowing that you may miss a few days. As a courtesy, please notify me if you expect to miss class so we know who to expect.\n\nClass Dates: SEPT 5, SEPT 19, OCT 3, OCT 17, OCT 31, NOV 14","displayLocation":"Minooka Park, 1927 E Sunset Dr. Waukesha, WI 53189","address":"1927 E Sunset Dr. Waukesha, WI 53189","date":"2023-09-05T00:00:00.000Z","startTime":"1899-12-30T11:00:00.000Z","endTime":"1899-12-30T13:00:00.000Z","repeats":"SEPT 5, SEPT 19, OCT 3, OCT 17, OCT 31, NOV 14","classMinimum":"1 Family","classMaximum":"21 Families","fee":"Requires a vehicle entrance permit. Daily ($6) or annual ($35).","supplies":"Dress for the weather. Snacks, water bottle, and any other favorite hike & park play gear recommended.","latitude":"42.987833470705276","longitude":"-88.1943378322832"},{"classTitle":"Tween/Teen Hangout - Sports, Hike, or Craft","classDescription":"Tweens/teens join us for an opportunity to build friendships, challenge yourself, and have fun! There will be teen-led activities to get us started, and then it will merge into hangout/free time. Tweens/teens can pick a group to join and work on a skill or learn something new. A group sport will be featured each week for those interested, such as flag football, kickball, archery, sand volleyball, rugby, or soccer. A group crafting/board game circle will have some basic supplies for drawing/art and board games. Please encourage your tween/teen to bring a game to play or supplies to work on their favorite crafts and even enough to share if they would like to teach others. A group can pick a trail to explore and do a hike together. \n\nWe will respect your child's comfort level on participating while creating an environment to give them an opportunity to build relatitudeionships, sharpen communication skills, and support one another. Multiple activities will be happening at once, and everyone is welcome to join whatever interests them. \n\nThis class is held at the same time as Terra Trails so families with multiple ages can offer a class to their older kids at the same time the younger kids have peer-relatitudeed activities. This class is recommended for tweens/teens 10 and older, and while parents are welcome, they are not required to stay. Because of the older age and activities, please reach out the facilitators if there are concerns with your tween/teen needing assistance/supervision, as they will be welcome to explore the park, trails, and participate in activities with their peer group without direct adult intervention. \n\nWhile attendance at enrolled events is encouraged, we do not want to discourage anyone from signing up for the class due to its frequency. It is ok to enroll in this class knowing you may miss a couple days. Please notify the facilitators if your tween/teen won't be there so we don't leave anyone behind as we explore. We plan to meet from 11am-1pm every other Tuesday starting 9/5. Please dress for the weather as we will be enjoying the outdoors. We will meet at Minooka Park in Picnic Area 3. We may occasionally explore a different area of the park and will send out a location change ahead of time. Please check email/FB before leaving the house due to possible weather cancellatitudeions day of.","displayLocation":"Minooka Park- 1927 E Sunset Dr, Waukesha","address":"1927 E Sunset Dr. Waukesha, WI 53189","date":"2023-09-05T00:00:00.000Z","startTime":"1899-12-30T11:00:00.000Z","endTime":"1899-12-30T13:00:00.000Z","repeats":"Every other week starting 9/5 (9/5, 9/19, 10/3, 10/17, 10/31, 11/14)","classMinimum":"none","classMaximum":"none","fee":"Minooka Park is a Waukesha County Park and requires an entrance fee ($6 daily/$35 yearly)","supplies":"Crafting & art supplies, board games or anything else they wish to share or use.","latitude":"42.987833470705276","longitude":"-88.1943378322832"},{"classTitle":"Circle Chess Club","classDescription":"A \"choose your own adventure,\" teen-led, parent-supported chess club. \n\nCircle Chess Club will meet for virtual play Wednesdays at 5pm - 6pm on Google Meet & in Chesskid. Come when you can. We'll have a club tournament each week if there is interest. \nChesskid is free unless you'd like a gold membership, which can be bought at a discount through WSCF.\n\nCircle Chess Club is part of the Wisconsin Scholastic Chess Federation (WSCF). Club members may choose to participate in live or virtual tournaments when the schedule is released in October. Maybe we can arrange to go to tournaments together. \n\nYou are invited to come to the planning picnic on August 30th.","displayLocation":"Hybrid - google meet, chesskid, live tournaments","date":"2023-09-06T00:00:00.000Z","startTime":"1899-12-30T17:00:00.000Z","endTime":"1899-12-30T18:00:00.000Z","repeats":"weekly","classMinimum":5,"classMaximum":"none","fee":"None through CIRCLE","supplies":"Chesskid membership, tournament fees if that path is chosen."},{"classTitle":"Oconomowoc Skate Park/Imagination Station Activity Day","classDescription":"We will start of at the Oconomowoc Skate Park where I will lead 15-20 minutes of stretching and introductions. Then kids will be able to choose to show off their skills at the skate park by skate boarding, rollerblading, scootering, or biking. Please bring your own equipment. They will also have the option of walking across the parking lot and playing at the Imagination Station Playground. This playground features rubberized surfacing, recycled plastic composite ramping, therapeutic swings and swinging deck, multi-sensory activity structures, musical and educational components, one entrance/exit safety, and more! Imagination Station and Oconomowoc Skate park is located in Roosevelt Park at 130 East Forest Street, Oconomowoc. Class is open to all ages!","displayLocation":"Roosevelt Park at 130 East Forest Street, Oconomowoc, WI 53066","address":"130 East Forest Street, Oconomowoc, WI 53066","date":"2023-09-06T00:00:00.000Z","startTime":"1899-12-30T10:00:00.000Z","endTime":"1899-12-30T12:00:00.000Z","repeats":"Wednesday, October 4th from 10-12","classMinimum":2,"classMaximum":100,"fee":0,"supplies":"Please bring whatever equipment you'd like your kids to use at the skate park.","latitude":"43.10248524489796","longitude":"-88.49839644897959"},{"classTitle":"South Beach through the Seasons","classDescription":"Fun at the beach doesn't end with summer! Join us at South Beach in Port Washington to see how the beach changes over the year. We'll make some notes about what we see happening with sand, water and sky, then dig in to some beach play. Bring a notebook or nature journal if you want to keep track of you observations through the year. South Beach is mostly sandy, with some rocky areas and patches of clay further down. As the weather cools and swimming becomes less enticing we'll spend more time exploring the shoreline, building sand castles, clay sculptures, or rock collecting. Keep in mind it can be quite a bit cooler by the lake so dress appropriately. Mud boots are helpful when bare feet aren't an option.","displayLocation":"South Beach, Port Washington","latitude":"43.38278959941492", "longitude":"-87.87011147890094","address":"South Beach, Port Washington","date":"2023-09-06T00:00:00.000Z","startTime":"1899-12-30T13:30:00.000Z","endTime":"1899-12-30T15:00:00.000Z","repeats":"October 4, Nov 1","classMinimum":"None","classMaximum":"None","fee":"None","supplies":"None"},{"classTitle":"Mod Podge Poetry","classDescription":"Let's peek through books to find fun, favorite, or inspiring words to cut out. Then, pick out a rock or sea shell (feel free to bring your own special rock/shell/gem to use as well) and create to your hearts content. A couple tall, ‘kids at heart’ will be available for ideas or inspiration if needed, but I’m sure the creativity will flow and they will be in awe when the kiddo’s creations are complete! Please bring scissors and your imagination. Ages 6+ welcome, younger is welcome to participate they may just need help from their adult for reading.","displayLocation":"Germantown Library Large Community Room N112W16957 Mequon Rd, Germantown, WI","latitude":"43.22042761034446", "longitude":"-88.11950492237672","address":"N112W16957 Mequon Rd, Germantown, WI","date":"2023-09-07T00:00:00.000Z","startTime":"1899-12-30T11:00:00.000Z","endTime":"1899-12-30T12:00:00.000Z","repeats":"No","classMinimum":"6 students","classMaximum":"12 students","fee":"$2/student","supplies":"scissors and your imagination"},{"classTitle":"Kickball","classDescription":"Kickball is a fun and engaging sport. The lack of both specialized equipment and highly skill-based positions (like the pitcher) makes the game an accessible introduction to relatitudeed sports such as baseball and softball.\n\nThis class will be Teen Led (Ryder 14,Mason 13) and Parent Supported. Thursdays 9/7, 9/14, 9/21, 9/28 \n\nThis will be a good fit for children 6 and older who are interested in a fun introduction to a sport. \n\nRyder and Mason have been playing and leading kickball for a number of years. It will be light hearted competition. Think playing a round with friends in your back yard.","displayLocation":"Froemming Park, 8801 S 51st St, Franklin, WI 53132","address":"8801 S 51st St, Franklin, WI 53132","date":"2023-09-07T00:00:00.000Z","startTime":"1899-12-30T11:00:00.000Z","endTime":"1899-12-30T12:30:00.000Z","repeats":"9/7, 9/14, 9/21, 9/28","classMinimum":8,"classMaximum":50,"fee":"None","supplies":"Comfortable shoes to run and kick\nWater","latitude":"42.881412749999996","longitude":"-87.98219351001865"},{"classTitle":"Intro to Lacrosse","classDescription":"Interested in learning a new sport? Want to try lacrosse? This class will be held by the director of Hot4Lax. He has over 35 years of experience teaching and coaching lacrosse. He is hosting this intro to lacrosse class for our group to help grow more interest in the sport of lacrosse. \n\nThe class will run about 1 hour 15 minutes (may be slightly more or less depending on the number of kids). He will provide all the needed equipment, the field and the coaching for the kids attending (full gear will not be needed for this intro class). If there is a group of kids interested in learning more after this intro class he is willing to set up a series with full gear. \n\nRecommended for ages 10 and up. Please be a few minutes early so class can start on time.","displayLocation":"Hot4Lax Lacrosse Center - 21675 Doral Road, Suite A, Waukesha WI","address":"21675 Doral Road, Waukesha WI","date":"2023-09-07T00:00:00.000Z","startTime":"1899-12-30T13:15:00.000Z","endTime":"1899-12-30T14:30:00.000Z","repeats":"No","classMinimum":5,"classMaximum":15,"fee":"$15/player","supplies":"none-equipment rental included","latitude":"43.042408947693225","longitude":"-88.18214292822633"},{"classTitle":"Tween / Teen Networking Picnic @ Froemming Park","classDescription":"Practice valuable networking skills and connect with other Teen/Tweens at Froemming Park in Franklin. Bring your lunch and a fun attitude. We're going to start with an ice breaker. Let's meet at the park to network over a picnic. \n\n**There is a game of Kickball happening just before this picnic. If you're up for a game, join us beforehand. (Kickball sign up is separate from this event)**","displayLocation":"Froenming Park 8801 S 51st St, Franklin, WI 53132","address":"8801 S 51st St, Franklin, WI 53132","date":"2023-09-07T00:00:00.000Z","startTime":"1899-12-30T12:30:00.000Z","endTime":"1899-12-30T14:00:00.000Z","repeats":"No","classMinimum":"None","classMaximum":"None","fee":"None","supplies":"Lunch","latitude":"42.881412749999996","longitude":"-87.98219351001865"},{"classTitle":"Awkward Night of Newness (Parents Only)","classDescription":"Come as strangers. Leave as colleageues in the homeschool world and friends in the village of raising weirdos.\n\nBring a gluten-free snack to share and beverage of your choice.\n\n\nWe'll gather on the patio at 4200 block (CIRCLE member's apartment). Exact location will be sent prior to event to all attendees.","displayLocation":"4200 block Milwaukee","address":"4200 block, Milwaukee, WI","latitude":"43.036005455991365", "longitude":"-87.92224118376683","date":"2023-09-09T00:00:00.000Z","startTime":"1899-12-30T18:30:00.000Z","endTime":"1899-12-30T21:00:00.000Z","repeats":"No","classMinimum":1,"classMaximum":20,"fee":"None","supplies":"Gluten-free snack and beverage of choice."},{"classTitle":"Pokémon GO fun!","classDescription":"Meet up and catch ‘‘em all! Have fun and get active, walking around catching Pokemon. We will show you how to catch them, spin Poke’ stops, defeat gyms, hatch eggs, level up and trade Pokémon. Some of the features are math and science based, so that’s a bonus to our fun! Each adventure will be at a different location.","displayLocation":"Meet at the West Bend library. 630 poplar St West Bend Wi","address":"630 poplar St, West Bend, Wi","date":"2023-09-11T00:00:00.000Z","startTime":"1899-12-30T11:00:00.000Z","endTime":"1899-12-30T12:30:00.000Z","repeats":"Yes 9/19 and 9/26. Same time but different locations. 9/19 will be in the Third Ward meeting at Milwaukee Public Market. 9/26 will be in Menomonee Falls at the Mill Pond Park.","classMinimum":"N/A","classMaximum":"N/A","fee":"Free","supplies":"A smart device with internet access and the downloaded Pokémon GO app.","latitude":"43.42085416230238","longitude":"-88.18410283409678"},{"classTitle":"Terra Kids-Mequon","classDescription":"Terra Kids, based on the concept of forest schools, will meet in the same natural location so that our children will learn the area and feel more comfortable exploring and to observe changes in the environment, connect with nature, and explore through interactive free play with other families while building community. Terra Kids will be a primarily child-led group, with parents acting as mentors and guides. We will meet at the Mequon Nature Preserve. It is a beautiful 38-acre park with trails amid forests, wetlands and fields, an observation tower and a nature center. Spending time outside is a vital part to every day and allows our children time to interact with nature, engage all their senses, and develop important life skills. Particularly, being outside in challenging weather encourages children to find the positive, be creative, and become more resilient. There are bathrooms available in the nature center, as well as a small sitting area for warming up, if needed. Terra Kids is open to all ages. Please dress for the weather. This class repeats the 2nd Monday of every month.","displayLocation":"Mequon Nature Preserve 8200 County Line Rd., Mequon, WI 53097","latitude":"43.1934501893939", "longitude":"-88.0102736785272","address":"8200 County Line Rd., Mequon, WI 53097","date":"2023-09-11T00:00:00.000Z","startTime":"1899-12-30T10:00:00.000Z","endTime":"1899-12-30T12:00:00.000Z","repeats":"10/9/23 and 11/13/23","classMinimum":"none","classMaximum":"none","fee":"none","supplies":"none"},{"classTitle":"Tennis at Fowler Park","classDescription":"Do you enjoy tennis? If so, come join your Circle friends for some friendly tennis matches together in a beautiful setting. Depending on who registers, we can match children with skill levels for more level play. If there is enough interest, we can create more match times to play together this fall. Fowler Lake Park also has playground equipment and a beautiful lake to enjoy! If it is warm enough, there is a nice place to swim. \nHope to see you there!","displayLocation":"Fowler Lake Park 438 N Oakwood Ave, Oconomowoc, WI 53066","address":"438 N Oakwood Ave, Oconomowoc, WI 53066","date":"2023-09-11T00:00:00.000Z","startTime":"1899-12-30T13:00:00.000Z","endTime":"1899-12-30T14:30:00.000Z","repeats":"No","classMinimum":"Minimum 1 participant","classMaximum":"No Max","fee":0,"supplies":"Tennis Racket and Balls (If you don't have tennis equipment, let us know and we can bring extra to share)","latitude":"43.1137966122449","longitude":"-88.49088759183674"},{"classTitle":"Guided kayaking tour on the Milwaukee river","classDescription":"Nature lovers!!! This is for you!!!!! Join us and our friends from Orenda Outdoors for a beautiful fall adventure down the Milwaukee River. Some of you may have signed up for the intro course to kayaking and some of you may be experienced Kayakers, all are welcome.\nKayaks, paddles and life jackets are all provided. We will be supported by an ACA certified crew member while we paddle down the Milwaukee river enjoying views of nature and explore the waterways. The leaves should be absolutely gorgeous this time of year.\nThis is a 2.5 - 3hr tour and includes instruction and transportation back to the shop. Kids under 12 will need to be accompanied by an adult. Minimum age is 6. Prices will vary on the size of our group.","displayLocation":"277 S Main ST West Bend Wi","address":"277 S Main ST, West Bend, Wi","latitude":"43.4211821304573", "longitude":"-88.18083770846066","date":"2023-09-12T00:00:00.000Z","startTime":"1899-12-30T13:00:00.000Z","endTime":"1899-12-30T16:00:00.000Z","repeats":"There is an option to have a repeated class if there is interest","classMinimum":5,"classMaximum":25,"fee":"Groups 15-19 $25 per person / Groups 20-25 $20 perperson","supplies":"Water shoes are recommended."},{"classTitle":"Minecraft Realm - Younger Virtual Community","classDescription":"Bi-monthly moderated sessions in a Minecraft Virtual Realm dedicated to the circle class. The players will create goals and community rules (with help of course!) together on their first session. They will play and work together with interference/aid from an adult as needed.\n\nThis Realm will be held as a peaceful, survival realm. There will be no monsters or nighttime--and inventory will be kept. This will allow them to learn the building/mining/resource managing part of the game without the stress of the dark or monsters.\n\nThe recommended age group for this server will be 6-9 (Beginners are welcome!). Children 10-12 can sign up as well, however there is a moderated Minecraft server geared toward children 10+ with minecraft experience that I would suggest looking into before signing up here.\n\nEach child participating will need access to discord. There is a well moderated Circle discord you will be invited into where we will have our own channel for Voice chat during the session. Your player will also need a headset with a microphone that can connect to the device you're using discord on, this will reduce background noise during the gaming session. I will contact families before our first session to help everyone get set up and answer any questions.\n\nSessions will take place on the following Wednesdays from 10:30 am to 12:30 pm: 9/13, 9/27, 10/11, 10/25, 11/8, 11/22","displayLocation":"Online","date":"2023-09-13T00:00:00.000Z","startTime":"1899-12-30T10:30:00.000Z","endTime":"1899-12-30T12:30:00.000Z","repeats":"9/27, 10/11, 10/25, 11/8, 11/22","classMinimum":2,"classMaximum":8,"fee":"None","supplies":"Class Supplies: A PC, tablet, or console (switch, ps4, etc) with the Bedrock version of Minecraft as well as access to discord and a headset with a microphone."},{"classTitle":"Light Benders Academy 001","classDescription":"Meet Mr.Joseph, a passionate and seasoned miniature painter, and a husband to Mrs.Mina, who runs art classes in many homeschool co-ops. After years of honing his craft, Mr.Joseph is now thrilled to be hosting his first class at Circle co-op, where he aims to inspire young minds with his expertise in the captivating world of miniatures. The demonstration class, designed to pique the interest of the community, is a preview of what's to come at the Light Benders Academy, an 8-class series during the winter semester where students will embark on an artistic journey, finishing with models and supplies provided in the class. With a wealth of experience spanning 25 years in miniature painting and tabletop board gaming, Mr.Joseph has found a deep appreciation for the art and is eager to share his knowledge and passion not only with kids but with adults who wish to participate as well. There is a younger children's play area in the library where Mrs. Mina will be, so any younger siblings are invited to come out. This class is intended for 10yrs&up.","displayLocation":"Menomonee Falls Public Library W156N8436 Pilgrim Rd, Menomonee Falls, WI 53051, Class is in the large Community Room","latitude":"43.1713944125926", "longitude":"-88.1015346240321","address":"W156N8436 Pilgrim Rd, Menomonee Falls, WI 53051","date":"2023-09-13T00:00:00.000Z","startTime":"1899-12-30T11:00:00.000Z","endTime":"1899-12-30T00:30:00.000Z","repeats":"No","classMinimum":0,"classMaximum":50,"fee":"FREE","supplies":"None- this class is a demonstration to introduce the concept and process of painting miniatures."},{"classTitle":"Terra Kids - NORTH","classDescription":"Terra Kids, based on the concept of forest schools, will meet in the same natural location so that our children will learn the area and feel more comfortable exploring and to observe changes in the environment, connect with nature, and explore through interactive free play with other families while building community.\n\nTerra Kids will be a primarily child-led group, with parents acting as mentors and guides. As such, we will be following our children's leads as we help them to explore. Dependent upon the day's desires, along with the weather, we may build forts, dams, play in the creek, climb trees, play nature-based games, or just explore. As each family and each individual is different, we respect that each family's needs as to what they are comfortable with as far as roaming and exploring goes may differ. Chances are that we will get dirty and muddy, wet and messy. Please dress appropriately.\n\nRidge Run County Park, with its evidence of glacial activity, is a 140-acre long narrow park. The major feature is a winding ridge (esker) formed by a subglacial river during\nthe last ice age. The Park is located on the interlobate moraine where the Green Bay and Lake Michigan Lobes of the Wisconsin Glacier met. Scattered throughout the Park is geological evidence of this event. http://www.co.washington.wi.us/uploads/docs/ridgerun2.pdf\n\nWe will meet at the park center parking lot. Feel free to bring water bottles and snacks or lunch and stay and play afterward. Terra Kids is open to all ages.\n\nNote: While attendance at events in which your family has enrolled is encouraged, we do not want to discourage anyone from signing up for the class due to its frequency. It is ok to enroll in this class knowing that you may miss a day here and there. As a courtesy, please notify me if you expect to miss a day, so that we are not waiting/looking for you in class.","displayLocation":"Ridge Run Park 300 S University Dr West Bend, WI 53095","address":"300 S University Dr, West Bend, WI 53095","date":"2023-09-13T00:00:00.000Z","startTime":"1899-12-30T10:30:00.000Z","endTime":"1899-12-30T12:00:00.000Z","repeats":"Every other week thru 11/22","classMinimum":"2 families","classMaximum":"No max","fee":"None","supplies":"None","latitude":"43.420579","longitude":"-88.211197"},{"classTitle":"Terra Kids - Retzer","classDescription":"Terra Kids, based on the concept of forest schools, will meet in the same natural location each week. Children will become familiar with the area and grow more comfortable exploring as they observe changes in the environment and connect with nature. Children will have the opportunity to engage in free play with other families while building community. Terra Kids will be primarily a child-led group, with parents providing support as needed. \n\nNotes:\n-Terra Kids is open to all ages with the target age range being 12 and under.\n-We will meet outdoors at the natural play area located down the short Discovery Trail next to the main building / planetarium. \n-Please dress for the weather.\n-Please check your email before leaving the house for any possible cancellatitudeions.\n-There is no daily entrance fee at Retzer Nature Center.\n\nAttendance: While attendance at enrolled events is encouraged, we do not want to discourage anyone from signing up for this class due to its frequency. It is ok to enroll knowing that you may miss a few days. Please notify me if you expect to miss class so we know who to expect.\n\nClass Dates: SEPT 14, SEPT 28, OCT 12, OCT 26, NOV 9\n\nClass Fees: None\nClass Supplies: None\n\nClass Min: 2 Families\nClass Max: 24 Families \n\nClass Coordinator: Laurie de Courcy-Bower & Amy Cushman\nEmail: lauriedcb@gmail.com\nPhone: 262-366-0037 (Laurie) 414-519-9150 (Amy)","displayLocation":"Retzer Nature Center: S14 W28167 Madison St, Waukesha, WI 53188","latitude":"43.01533764618464", "longitude":"-88.31110950258197","address":"S14 W28167 Madison St, Waukesha, WI 53188","date":"2023-09-14T00:00:00.000Z","startTime":"1899-12-30T13:00:00.000Z","endTime":"1899-12-30T15:00:00.000Z","repeats":"SEPT 14, SEPT 28, OCT 12, OCT 26, NOV 9","classMinimum":"None","classMaximum":"25 families","fee":"None","supplies":"Your favorite outdoor play gear, if desired (e.g., sunscreen, hats, water bottles, snack, etc.)"},{"classTitle":"Moms Night of Productive Fun","classDescription":"A night of fun & productiveness. We'll relax on the patio at 4200 (CIRCLE member's apartment) and use the complex carwash to clean out the mom mobile. Feel free to bring small projects that can get done on the patio with the company of friends, snacks, and beverages. Bring a gluten-free snack to share and beverage of your choice.","displayLocation":"4200 block in Milwaukee Circle members Apartment Complex","latitude":"43.036005455991365", "longitude":"-87.92224118376683","address":"4200 block, Milwaukee, WI","date":"2023-09-15T00:00:00.000Z","startTime":"1899-12-30T18:30:00.000Z","endTime":"1899-12-30T21:00:00.000Z","repeats":"No","classMinimum":1,"classMaximum":20,"fee":"None","supplies":"Bring a project to work on, a gluten-free snack to share, and a beverage of choice."},{"classTitle":"The skeletal system with Dr. Amy","classDescription":"Learn all about the skeletal system with Chiropractor Dr. Amy Elliott. She will talk to us about muscles and bones, function, and how these things affect our lives as humans. Come and learn a little bit more about how your body works!","displayLocation":"Bay View library community room 2566 S. Kinnnickinnic Ave. Milwaukee, WI 53207","latitude":"42.998283611704686", "longitude":"-87.89978844735211","address":"2566 S. Kinnnickinnic Ave. Milwaukee, WI 53207","date":"2023-09-15T00:00:00.000Z","startTime":"1899-12-30T13:00:00.000Z","endTime":"1899-12-30T14:00:00.000Z","repeats":"No","classMinimum":"10 attendees","classMaximum":"60 people","fee":"None","supplies":"None"},{"classTitle":"Vintage Vault Arcade - Chat with the Owner and Play Vintage Arcade Games All Day!","classDescription":"Come for an afternoon of all-day play at Vintage Vault Arcade! Vintage Vault Arcade is just that - a vintage arcade with over 125 \"old-school\" arcade machines! The owner has spent years researching, locating, and repairing vintage arcade machines with the passion to bring this fun to his community! So, \"Let's Go!\" and enjoy an afternoon together! \n\nJames, the owner, will begin the afternoon with a short 15-20 minute talk with us on what it has taken to bring his passion to life. He will share the fun and challenges of running a small business and even tell us about the research, restoration, and repair of these classics and some rare and hard-to-find arcade machines. James will then be available all afternoon for any questions and to help make sure we enjoy the fun!\n\nEach person (adult or child) who would like to play will pay $10 for unlimited play and access to over 125 arcade machines, including Donkey Kong, Atari Poll Position, Pac-Man, Dragon Saber, Midway, and ssssoooo many more! Our CIRCLE Event is from noon to 3 pm, but your $10 pass will cover you for the entire time Vintage is open that day, 9/15/23 (Vintage Vault is open Fridays, noon - 10:00 pm), so you can leave and come back if you are in it for the long haul or truly stay all day and play! Each machine has been set up to play without the need for quarters or tokens! There will be tables set up for us outside under an awning overlooking Phantom Lake. We are welcome to bring snacks and drinks to keep outside at our tables for \"snack breaks\" or bring in closed drink containers to get you through the marathon matches. \n\nIf you can't make it right at noon but still want to join us - feel free! This CIRCLE rate, and all-day play for this event, is $10 per player (usually $20 per person) if you sign up here, pay, and arrive anytime between 12-3 pm. \n\nThis event is open to all ages! (You know your kids best!) Feel free to contact Vintage Vault Arcade for more specific information on the games available, but James mentioned his clientele is usually 8-80 years old! \n\nCome to play with old friends and new friends and hear a bit about a new, fun, niche, local small business! \n\"Let's Go!\"","displayLocation":"715 Main St, Suite 200, Mukwonago, WI, United States, 53149","address":"715 Main St, Suite 200, Mukwonago, WI, 53149","latitude":"42.85755010665447", "longitude":"-88.33242282083745","date":"2023-09-15T00:00:00.000Z","startTime":"1899-12-30T12:00:00.000Z","endTime":"1899-12-30T15:00:00.000Z","repeats":"No","classMinimum":"Minimum 30 paid attendees","classMaximum":"Maximum 70 paid attendees","fee":"$10 for each person who will be playing any arcade games, no fee for anyone not playing","supplies":"none"},{"classTitle":"Educator Open House at MOWA (Parents)","classDescription":"Come join me for the Educator Open House at the Museum of Wisconsin Art! \n\nThis is one of my family's favorite museums. I reached out to the MOWA and asked if homeschool educators would be welcome and her answer was an enthusiastic yes! \n\nMOWA's event is a drop-in event, starting at 10 and ending at 2. We will plan to meet around 10 (though if you need to come latitudeer, please just let me know!) The event at MOWA is free-flowing and we will play it by ear as to what our group will do. \n\nThe event at MOWA includes: \n*Meet exhibiting artist and educator John Fleissner as you enjoy drop-in art making\n*Experiment with classroom-friendly approaches to street art\n*Pick up free resources to inspire student learning\n*Enter to win door prizes and receive a voucher for complimentary membership that offers unlimited access to experience new exhibitions, enjoy lectures, and dive into educational opportunities for a full year\n*Connect with educators over complimentary refreshments\n\nThis event is free for all K-12 educators, administrators, student teachers, and school staff (and homeschool educators - I checked!). The first 50 attendees will receive a tote filled with indulgent treats and surprises (this is through MOWA not me).\n\nWhen we are done with our time at the museum, you are welcome to head home if needed. Otherwise, join us for a 10 minute walk (or 3 minute drive) to Cafe Floriana (https://cafefloriana.com/) to keep some conversation going over lunch. (Did you know that MOWA members receive one 2-pack cookies free with purchase at Cafe Floriana? It's a member perk!)","displayLocation":"Museum of Wisconsin Art - 205 Veterans Avenue, West Bend, WI 53095 and Cafe Floriana - 611 Veterans Ave #104 West Bend, WI","address":"205 Veterans Avenue, West Bend, WI 53095","date":"2023-09-16T00:00:00.000Z","startTime":"1899-12-30T10:00:00.000Z","endTime":"1899-12-30T14:00:00.000Z","repeats":"No","classMinimum":"No minimum","classMaximum":"No maximum","fee":"No fee collected through CIRCLE,; pay for your own lunch if joining us for lunch","supplies":"None","latitude":"43.42324525556125","longitude":"-88.18093111557148"},{"classTitle":"Field Trip Science","classDescription":"I've partnered with Field Trip Academy to bring this three month course to CIRCLE! \n\nField Trip Academy leverages the power of technology and real world science projects to deepen kids understanding of the natural world. \n\nIn this class, you will have access to The Field Trip Academy’s online videos,\ncontent lessons, hands-on activities, and resources. You will have information to learn at home ahead of time, then we will come together for the hands-on portion, then afterwards, you have resources to follow up with at home. I will create a google classroom so that we can share information, questions, pictures when we are not together for the hands-on portion. \n\nThis class is for all ages and includes content for teens and tweens. My own kids are 8 and 11. If we are a larger group, we can split into smaller groups on location for the activities, then come back together at the end. (Example: We might split into older kids and younger kids.)\n\nEach month has a different theme and in this Fall 2023 Session of Circle, we will be exploring the following: \n\nSeptember: Aquatic macroinvertebrates\n\nAquatic macroinvertebrates (macros) are small organisms that live in streams.\n\nJoin us on a field trip to Jacobus Park (Wauwatosa) to catch and identify macros and use them to measure the stream’s health!\n\nBe prepared to get wet! For our location, water shoes and bug spray are highly recommended (but optional). Younger learners will likely need some help collecting.\n\nSupplies:\n● Basic kitchen items (dish, ice cube tray, cup, and spoon)\n● Small “aquarium” (or other water) net (if you don’t have one, one can be purchased from stores such as Meijer for less than $5) \n● Magnifying lens\nWriting/drawing supplies, journal - Optional: clipboard\n\nOctober: Fall Leaves\n\nJoin us on a field trip to Sanctuary Woods (Wauwatosa), where we will spend time exploring fall leaves. You will complete a group Fall Bingo scavenger hunt, sketch in a nature journal, and create a mandala from found natural elements.\n\nYounger learners will likely need some minor assistance for the Fall Bingo.\n\nSupplies:\n● Collection bag(s)\nWriting/drawing supplies, journal, Optional - clipboard\n\nNovember: Winter Plants and Seeds \n\nJoin us on a field trip to Sanctuary Woods (Wauwatosa), where we will learn how to identify common types of plants in their dormant/dead state and forage for seeds to learn more about seed dispersal methods.\n\nBe prepared for the weather - I think we all know November in Wisconsin is unpredictable.\nSupplies:\n● Nature journal & writing supplies - Optional: Clipboard\n● Hand lens or Pocket Microscope \n\nThere are some materials that you will need to print for our field days - but I don’t want lack of a printer to keep anyone from participating! I will reach out before class and find out if anyone needs me to print extra copies for them. \n\nThe class fee is $45 and covers all course materials for the entire three months. This is paid directly to Field Trip Academy. They have put together a special module for our group - instructions about how to access this will be emailed to you after fees are collected. \n\nLocation notes: There is one pipe that needs to be climbed over to get to our location at Jacobus Park, but there is another less direct more accessible entrance and I will send out instructions for that entrance as well. Also, Sanctuary Woods does not have an actual street address, but I will send out a map and instructions for reaching the parking area.","date":"2023-09-18T00:00:00.000Z","startTime":"1899-12-30T10:00:00.000Z","endTime":"1899-12-30T12:00:00.000Z","repeats":"October 16th and November 20th - Location for both is: Sanctuary Woods - it is on an unnamed road, the closest address is 9480 W Watertown Plank Rd, Wauwatosa, WI 53226","classMinimum":"2 families","classMaximum":"No max","fee":"No fee collected through Circle - $45 one-time payment to Field Trip Academy","supplies":"See class description as to which supplies are needed for which month: \n-Basic kitchen items (dish, ice cube tray, cup, and spoon)\n-Small “aquarium” (or other water) net (if you don’t have one, one can be purchased from stores such as Meijer for less than $5) \n- Magnifying lens\n-Writing/drawing supplies, journal \n-Collection bag(s)\nOptional: Clipboard \n\nAccess to internet for access to Field Trip Academy \n\nPlease reach out if you are concerned you will not have the supplies - I do have extras of some of the supplies I can share."},{"classTitle":"Terra Kids-South","classDescription":"Terra Kids, based on the concept of forest schools, will meet in the same natural location so that our children will learn the area and feel more comfortable exploring and to observe changes in the environment, connect with nature, and explore through interactive free play with other families while building community.\n\nTerra Kids will be a primarily child-led group, with parents acting as mentors and guides. As such, we will be following our children's leads as we help them to explore. Dependent upon the day's desires, along with the weather, we may play at the natural play area, climb trees, play nature-based games, or just explore/hike. As each family and each individual is different, we respect that each family's needs as to what they are comfortable with as far as roaming and exploring goes may differ. \n\nChances are that we will get dirty and muddy, wet and messy. Please dress appropriately. \n**All ages welcome! I will be bringing my 6 year old son. \n\n**Wehr nature center has a small natural play area and several trails to hike. Let's meet at the play area next to the building and either take the shorter (0.5mi) family friendly hike, or the longer (1.5mi) hike. Bathrooms are located in the building. There is a $5 parking fee for non members.\n\nhttps://friendsofwehr.org/","displayLocation":"Wehr Nature Center - 9701 W College Ave, Franklin, WI 53132","address":"9701 W College Ave, Franklin, WI 53132","date":"2023-09-18T00:00:00.000Z","startTime":"1899-12-30T13:30:00.000Z","endTime":"1899-12-30T15:00:00.000Z","repeats":"10/16, 11/20","classMinimum":0,"classMaximum":"No max","fee":"$5 parking fee for non members","supplies":"Proper dress for the weather","latitude":"42.925099849999995","longitude":"-88.03610367063439"},{"classTitle":"Goldfish Swim","classDescription":"Want to keep swimming strong through the colder months? Come play with us! Goldfish Swim School is a family-friendly facility dedicated to kids ages 4 months to 12 years old but older siblings are welcome too. The “deep end,” which is in the middle, has a depth of 4-foot-3-inches, and the shallow end is 3-foot-6-inches. It does not have a tricked-out water playground or water slides. What it has is wonderful 90° water with submerged swim platitudeforms that will keep your kids active and swimming. Pay an annual membership fee of $25 per child up to a maximum of $50 per family or pay a daily fee of $5 per child up to a maximum of $15 per family. Parents and caretakers swim for free. Coast guard approved floatation devices are welcome. Lifeguards are always on duty. Want to swim more? Family swim is offered from 12:45 PM - 1:45 PM on both Wednesdays and Thursdays year round.\n\nThis class is being offered in September, October, November and (December - winter session). Attend all, or attend one, just note which ones in your sign-up.","displayLocation":"12565 W Feerick St Brookfield, WI 53005","address":"12565 W Feerick St Brookfield, WI 53005","date":"2023-09-20T00:00:00.000Z","startTime":"1899-12-30T12:30:00.000Z","endTime":"1899-12-30T14:00:00.000Z","repeats":"September 20, October 18, November 15, December 20 (next session)","classMinimum":"none","classMaximum":"none","fee":"None - Make payment directly at GSS.","supplies":"goggles (to encourage swimmers to submerge their faces, also available to borrow for free), swimsuits, towels, after-swim snack","latitude":"43.08595721993126","longitude":"-88.06837874054847"},{"classTitle":"Hispanic Heritage Month Celebration & Dance Class","classDescription":"Let’s celebrate Hispanic Heritage Month! \n\nBring scissors and a water bottle, and dress for playing outside! \n\nActivities will include: \n- Baile Folklórico Dance class\n- Bilingual Spanish/ English story time \n- Outdoor games both incorporating Spanish language and games played in Latitudein America \n- Papel picado craft \n- Traditional “Lotería” Game \n\nFeel free to pack a lunch if you’d like to stick around play at the park afterwards.\n\nI believe this activity will be best suited for children ages 10 and under, though older children are certainly welcome if interested.","displayLocation":"LaFollette Park - 9418 W Washington Street, Milwaukee, WI 53214","address":"9418 W Washington Street, Milwaukee, WI 53214","date":"2023-09-20T00:00:00.000Z","startTime":"1899-12-30T10:00:00.000Z","endTime":"1899-12-30T12:00:00.000Z","repeats":"No","classMinimum":"Minimum 8 students","classMaximum":"Maximum 18 students","fee":"$14 / student","supplies":"Scissors","latitude":"43.019671613568185","longitude":"-88.02987299925702"},{"classTitle":"Biking on the Eisenbahn","classDescription":"‘’Eisenbahn” is the German word for railroad and the trail is built on a former railroad corridor. \nThe Eisenbahn trail includes a 5 mile paved path through West Bend. It is a beautiful trail that goes along the river as it takes you through the city. There are fun little stops and sights throughout. My older kids will be leading the group, Lucas (15) and Brandon (14). We recommend that any bikers under 12 bring an adult. I will be walking behind if other parents and younger kids want to join.\n\nWe will meet at the Barton Mill and the bikers will head out from there. We would expect this to take around an hour to complete, but it could be a little longer. Bring your water bottles!","displayLocation":"Barton Mill 1784 Barton Ave West Bend Wi 53095","address":"1784 Barton Ave, West Bend, Wi 53095","date":"2023-09-20T00:00:00.000Z","startTime":"1899-12-30T15:00:00.000Z","endTime":"1899-12-30T16:30:00.000Z","repeats":"No","classMinimum":"None","classMaximum":"None","fee":"None","supplies":"Bike and water bottle","latitude":"43.442033","longitude":"-88.1809"},{"classTitle":"Unschooling/Life Learning Discussion Group","classDescription":"Let’s get together and talk about Unschooling/Life Learning! This group is for families currently following the life learning philosophy and for those who are interested in learning more about what we do. Everyone is welcome! If the kids don’t want to listen in on the conversation they can roam the library and socialize amongst themselves. This will be an open discussion group that we will let unfold organically but keep with a life learning theme. \n\nThe group meets monthly, Sept 21st, Oct 18th and Nov 15th. We will gather in the Children’s/Teen section of the library.","displayLocation":"West Bend Community Memorial Library, 630 Poplar St., West Bend, WI, 53095","address":"630 Poplar St., West Bend, WI, 53095","date":"2023-09-21T00:00:00.000Z","startTime":"1899-12-30T10:30:00.000Z","endTime":"1899-12-30T11:30:00.000Z","repeats":"October 18, November 15","classMinimum":"None","classMaximum":"None","fee":"None","supplies":"None","latitude":"43.42085416230238","longitude":"-88.18410283409678"},{"classTitle":"Stitch Class 101","classDescription":"This is a hand stitching club that will meet once a month to learn different hand stitching techniques, and to work on different projects that your children will be so proud of. In the month of September, we will be making hand stitched pencil cases that we can store our loose writing utensils. October we will hand stitch our very own mask, so come prepared with your creative ideas to make a mask unique to you. Lastly, in November, we will put on a puppet show with our handmade puppets that we will make, if time allots, so prepare to become puppeteers! (Don’t worry, this part is optional for those who may be shy).\n\nThis class is suggested for ages 6-13, but if a younger child is interested, I would recommend parental guidance. If an older child displays interest in any of the projects, they are more than welcome to participate. If there are older children who would like to assist with the younger children, I can definitely use the help, please reach out or place!\n\n*These classes are listed separately on the calendar/enrollment form, which reoccurs every 4 weeks. You do not have to sign up for all three classes, choose the ones that you feel will interest your child. Also, since we had our intro class in the summer, I will give directions first, then branch off to demonstrate stitches our new faces. I would recommend that new attendees bring a few swatches of fabric (preferably felt, any thick material, or clothing you do not mind destroying) to practice their stitches on.\n\nAfter class, there is a park nearby, called Coopers Park that we can meet and have lunch. I don't think I've been before, but it looks nice!\n\n(This class will be held at a religious facility, but it will remain a secular event.)","displayLocation":"Mount Carmel Lutheran Church (Friendship Hall), 8424 W. Center St., Milwaukee, WI 53222","address":"8424 W. Center St., Milwaukee, WI 53222","date":"2023-09-21T00:00:00.000Z","startTime":"1899-12-30T11:00:00.000Z","endTime":"1899-12-30T13:00:00.000Z","repeats":"Every 4 weeks, 10/19/23, 11/16/2023","classMinimum":10,"classMaximum":20,"fee":"$5/ per student each session","supplies":"Ruler, large eye embroidery needle, *needle threader, scissors, *multicolor embroidery floss, I will provide black and white. (Supplies with an asterisk is suggested or optional, but not required)","latitude":"43.06820265","longitude":"-88.01810912318246"},{"classTitle":"Indian Summer Honey Farm Tour","classDescription":"Join us for a tour of a honey farm! Learn about how bees make honey and honey extracting process on a family farm of beekeepers. This tour is free and appropriate for all ages. The tour lasts about an hour, and there is a store wheee you can buy honey products afterwards.","displayLocation":"N128W12930 Highland Rd, Germantown, WI 53022","latitude":"43.25241987075784", "longitude":"-88.069479763584","address":"N128W12930 Highland Rd, Germantown, WI 53022","date":"2023-09-22T00:00:00.000Z","startTime":"1899-12-30T10:00:00.000Z","endTime":"1899-12-30T11:00:00.000Z","repeats":"No","classMinimum":"10 attendees","classMaximum":"None","fee":"None","supplies":"None"},{"classTitle":"Teen Fall Fest & Feast","classDescription":"Are you between the ages of 13-18 and sick of going to meet ups where you are ten years older than everyone else? Then this hang out is for you! *insert finger guns and tongue click here* \n\nJoin us fellow awkward teens to hang out and hopefully make some new connections. There will be music...There will be games...There will be activities...There will also probably be some awkward standing around staring at our feet trying to figure how to life....but no worries! Bring on the super weird ice breakers!!! We got this! *insert supportive thumbs up here*\n\nWe will provide the venue, the drinks and the fun.... think escape room style scavenger hunt, trivia, and party games. Participate in what you enjoy or sit back and watch the chaos. We are good with either! There will be no forced socializing.\n\nWe ask that you each bring at least one dish to share for the potluck. We will send out a sign-up genius to avoid an overabundance of desserts.....not that that would be the worst.\n\nThe park has bathrooms available as well as soccer fields, volleyball courts, and a basketball court. Feel free to bring sports equipment, camp chairs or other activities you enjoy. \n\nThe cost is $10 per teen. \n\nIf you do not have a county park pass, no worries! A parking pass code will be sent out before the event so you do not need to pay the parking fee. \n\nNot super cool with leaving your teen with us random peeps? Have younger kids who need something to do? Feel free to bring a picnic, explore the park, hike the trails, fish in the pond, or check out the playground....or sit in your car with binoculars spying to see if you kid is talking to anyone! Come on parents, we know you do that! We don't blame you but it's still kinda weird.","displayLocation":"Homestead Hollow County Park N120 W19809 Freistadt Road, Germantown, WI 53022","latitude":"43.23466618898043", "longitude":"-88.15533694867004","address":"N120 W19809 Freistadt Road, Germantown, WI 53022","date":"2023-09-22T00:00:00.000Z","startTime":"1899-12-30T17:00:00.000Z","endTime":"1899-12-30T21:00:00.000Z","repeats":"No","classMinimum":"Minimum 10","classMaximum":"Maximum 50 teens","fee":"$10 per teen","supplies":"Potluck item and any desired sports equipment or picnic items"},{"classTitle":"Dungeons and Dragons for Younger Kids","classDescription":"If your child has a vivid imagination and enjoys playing pretend, this is a good place to practice those skills! DnD is a table top roleplaying game that incorporates the use of dice rolls and roleplay to craft unique and engaging adventures.\n\nI will host age-appropriate adventures that will offer the chance to roleplay their characters, solve problems, and create memorable stories together through improv.\n\nEach class will be held as an independent adventure so if players are unable to make one class, they will be able to jump back in fairly easily. Part of the first session will be focused on creating and understanding our characters.\n\nThese sessions will be geared toward children aged 6-10, older siblings and children are still welcome to join if they are okay with simpler story mechanics.\n\nSupplies and snacks will be provided(feel free to bring your own snacks and drinks too!). Children are encouraged to dress up as their characters if they are inclined to but it is also not required.\n\nDATES:\nSeptember 25 2023 - 12-3:30 PM\n\nOctober 16, 2023 - 12-3:30 PM\n\nNovember 13, 2023 - 12-3:30 PM\n\n\nDisclaimer: There are dogs that live at the residence. They will be locked away during the sessions but those with allergies and sensitives to dog noises please keep this in mind when signing up.","displayLocation":"Waldo, Wisconsin (private residence, address will be given closer to)","address":"Waldo, WI","date":"2023-09-25T00:00:00.000Z","startTime":"1899-12-30T12:00:00.000Z","endTime":"1899-12-30T15:30:00.000Z","repeats":"October 16, 2023 12-3:30 PM and November 13 12-3:30 PM","classMinimum":3,"classMaximum":6,"fee":"$5 dollars per player (parents/non playing siblings have no fee)","supplies":"Supplies will be included. If players want to bring their own dice and figures they are welcome to but it is not required.","latitude":"43.6747179","longitude":"-87.9487034"},{"classTitle":"Fall Equinox campfire","classDescription":"Celebrate the fall equinox(actual equinox is Sept. 23), with a campfire, smores, hike, and some not so spooky campfire stories.\nWe will meet at the fire pit at Glacier Hills county park, near the playground. \nA Washington county park pass is required for entry into the park. Day passes can be purchased on the county website. https://g.co/kgs/p4xWX2","displayLocation":"Glacier Hills County Park 1664 Friess Lake Rd, Hubertus, WI 53033","latitude":"43.24977754623737", "longitude":"-88.29145320881199","address":"1664 Friess Lake Rd, Hubertus, WI 53033","date":"2023-09-25T00:00:00.000Z","startTime":"1899-12-30T15:00:00.000Z","endTime":"1899-12-30T17:00:00.000Z","repeats":"No","classMinimum":"10 attendees","classMaximum":"None","fee":"$3/ family to cover firewood","supplies":"A county park sticker is required for park entry."},{"classTitle":"Tour the National Weather Service Office","classDescription":"Weather forecasts are a critical part to homeschool activities. Let's see where it all happens, consider a career in meteorology, and tour the National Weather Service office. \n\nIt's a small office, so we'll try to split into 2 groups by age - one group will tour and one will hang in the parking lot with some card games and then switch. \n\nGood questions and behavior appropriate for an office is a must. \n\nThe tour will be canceled if severe weather requires all hands on deck in the weather office.","displayLocation":"N3533 Hardscrabble Rd, Dousman, WI 53118","latitude":"42.96799605414187", "longitude":"-88.55050593639325","address":"N3533 Hardscrabble Rd, Dousman, WI 53118","date":"2023-09-25T00:00:00.000Z","startTime":"1899-12-30T13:00:00.000Z","endTime":"1899-12-30T14:00:00.000Z","repeats":"No","classMinimum":"5 people","classMaximum":"27 people on the tour.","fee":"None","supplies":"Questions for the tour guides."},{"classTitle":"Concord General Store & Zoo Field Trip","classDescription":"Let’s go on a field trip to the Concord General Store & Zoo! This little gem is tucked away right off the highway in Oconomowoc. We will meet to feed the animals and explore the general store then picnic for lunch! The store has food options for lunch to purchase as well if you prefer in addition to a coffee bar. Join us for a chance to connect with nature, animals, and community!","displayLocation":"N6485 CR-F Oconomowoc, Wisconsin 53066","address":"N6485 CR-F, Oconomowoc, Wisconsin 53066","latitude":"43.079607462795515", "longitude":"-88.58918710382154","date":"2023-09-25T00:00:00.000Z","startTime":"1899-12-30T10:30:00.000Z","endTime":"1899-12-30T12:30:00.000Z","repeats":"No","classMinimum":1,"classMaximum":20,"fee":"$4 per family for animal feed","supplies":"Bring or buy your lunch!"},{"classTitle":"Paint-and-Sip Kids Edition","classDescription":"Has your child ever wanted to learn to paint like a master? Well, this class is for you! An experienced art teacher, and owner of Create with Heart, will be teaching the \"ins and outs\" of an acrylic, fall painting on an 8x10 canvas. The teacher will focus on basic technique and mixing colors. Some of the design will be drawn by the teacher ahead of time and some stencils will be used to make things a little easier for younger artists. The teacher has a great winter, paint project in mind to build upon these skills in the next session of classes.\n\nThe class is geared towards 6-year-olds and older, but we can work with any age if your child really wants to paint. \n\nTypically, paint-and-sip classes involve adult beverages, but we will be serving milk, cider and hot chocolatitudee. \n\nFinally, I am working with the West Bend Library to have the art displayed during the month of October. It sounds promising but I don't have a final yes...yet :)","displayLocation":"Our house in Allenton just outside of Kewaskum","address":"Allenton, WI","date":"2023-09-25T00:00:00.000Z","startTime":"1899-12-30T16:00:00.000Z","endTime":"1899-12-30T17:30:00.000Z","repeats":"No","classMinimum":6,"classMaximum":8,"fee":"$15 per painter","supplies":"None","latitude":"43.4210536","longitude":"-88.3408655"},{"classTitle":"Book Explorers/Library Hangout","classDescription":"Come to the Wauwatosa Public Library for Book Explorers with librarian Anne Kissinger and a library hangout for everyone else!\n\nDuring this session of Book Explorers (formerly known as Early Chapter Book Discussion), the biography genre will be presented with an emphasis on discovery and utilizing multiple resources. \n\nIf you have attended this program before, you already know that we like to hear about books and often take other people's suggestions. Please bring a book that you have already read or currently reading (does not have to fit with the theme each meeting) to tell us a little bit about it. \n\nEach Book Explorers will begin with a short oral story and end with an activity.\n\nNote, all the discussions are voluntary and no one will be required to speak.\n\nImportant: You must pre-register for this event on the library website in addition to signing up through CIRCLE. A reminder email will be sent out to those who sign up for this class.\n\nhttps://www.wauwatosalibrary.org/kids/program-registration","displayLocation":"Wauwatosa Public Library, 7635 W North Ave Wauwatosa, WI 53213 United States","address":"7635 W North Ave, Wauwatosa, WI 53213 United States","date":"2023-09-28T00:00:00.000Z","startTime":"1899-12-30T10:30:00.000Z","endTime":"1899-12-30T11:30:00.000Z","repeats":"No","classMinimum":"none","classMaximum":"12 Book Explorers participants; No maximum Library Hangout participants","fee":"none","supplies":"a book that you have already read or currently reading (does not have to fit with the theme each meeting)","latitude":"43.06065978490761","longitude":"-88.00809176591339"},{"classTitle":"Fungus Among Us - New Fane Trail Edition","classDescription":"Interested in learning more about fungi in the wild? We will take a hike and provide information on fungi we pass and those that grow locally that we may not see. As an avid forager with a deep interest in mycology, we will also point out other wild edibles as we pass them. We will take pictures (if you have a camera), draw, answer questions and enjoy the nature around us on our hunt. After concluding our hike, we can have a lunch picnic (not required and please bring your own food) and further discuss. All ages welcome, although the content may be best served between ages 4-13.","displayLocation":"New Fane Trail, Kewaskum - will send pin to trailhead to participants","latitude":"43.543261346180024", "longitude":"-88.17659860270739","address":"New Fane Trail, Kewaskum","date":"2023-09-29T00:00:00.000Z","startTime":"1899-12-30T10:30:00.000Z","endTime":"1899-12-30T12:00:00.000Z","repeats":"No","classMinimum":"4 students","classMaximum":"10 students","fee":"None","supplies":"Bug spray, sunscreen, hiking appropriate clothes (pants preferred), water, snacks, notebook and a writing utensil"},{"classTitle":"Handmade Papermaking Workshop","classDescription":"Learn how to make/recycle paper, real paper you can write or draw on.This hands-on workshop is open for kids (7 and up) and/or adults.","displayLocation":"South Milwaukee Public Library 1907 10th Ave, South Milwaukee, WI 53172","address":"1907 10th Ave, South Milwaukee, WI 53172","date":"2023-09-29T00:00:00.000Z","startTime":"1899-12-30T13:00:00.000Z","endTime":"1899-12-30T15:00:00.000Z","repeats":"No","classMinimum":4,"classMaximum":8,"fee":"None","supplies":"This class is messy, clothes might get wet or dirty. Please plan accordingly and feel free to bring a smock or apron.","latitude":"42.91224425","longitude":"-87.86025695580403"},{"classTitle":"Shedd Aquarium Adventure","classDescription":"The whales and fish are calling you, so come and explore the Shedd Aquarium in Chicago. The aquarium's focus is sparking compassion, curiosity and conservation for the aquatic animal world. You will be able to see beluga whales, coral reefs, dolphins, and maybe even pet a few underwater friends!\n\nSee https://www.sheddaquarium.org/ or more information on the Shedd Aquarium's exhibits. \n\nOur entire group must be present BEFORE 11:20am in order to enter with discounted tickets, please keep this in mind. I put 5pm as the end time because that is when the aquarium closes, but you are free to leave whenever you want.\n\nWeather dependent, there may be an opportunity to feed some stingrays, this is an extra $5 per cup of fish. Families will need to pay for this in-person on the day of.\n\nAttendees responsible for their own parking, the museum suggests these lots: https://www.sheddaquarium.org/plan-a-visit/getting-to-shedd","displayLocation":"Shedd Aquarium, 1200 S DuSable Lk Shr Dr, Chicago, IL 60605","latitude":"41.867732056053455", "longitude":"-87.61403506540891","address":"1200 S DuSable Lk Shr Dr, Chicago, IL 60605","date":"2023-10-02T00:00:00.000Z","startTime":"1899-12-30T11:00:00.000Z","endTime":"1899-12-30T17:00:00.000Z","repeats":"No","classMinimum":"15 participants","classMaximum":"None","fee":"Aquarium admission: $21.95/child, $30.50/adult","supplies":"None required, but I highly recommend bringing a lunch and snacks."},{"classTitle":"Shadow Drawing At Lynden Sculpture Garden","classDescription":"Let’s see some sculptures and let’s use the sun to make shadow drawings of them at one amazing place:\nLynden Sculpture Garden!\n\nThe Lynden Sculpture Garden offers a unique experience of art in nature through its collection of more than 50 monumental sculptures sited across 40 acres of park, lake and woodland.\n\nWe can enjoy the outdoors, see some art, talk about the weather and enjoy their beautiful landscaped grounds. \n\nWe will have some books we can read about the sun, shades and art overall so we can seat down and enjoy some nature time while we draw and see how the shadows move within the time we are there. \n\nBring a lunch if you want to stay and hang out some more.","displayLocation":"The Lynden Sculpture Garden. 2145 West Brown Deer Road Milwaukee, WI 53217","address":"2145 West Brown Deer Road, Milwaukee, WI 53217","date":"2023-10-02T00:00:00.000Z","startTime":"1899-12-30T10:00:00.000Z","endTime":"1899-12-30T12:00:00.000Z","repeats":"No","classMinimum":"Minimum 10","classMaximum":"No maximum","fee":"FREE entry to the garden. “The Lynden Sculpture Garden is open to the public during the hours listed below. Thanks to the generosity of donors, admission is free at this time.“","supplies":"None. We will provide everything needed for the activity.","latitude":"43.1758911","longitude":"-87.93727947577182"},{"classTitle":"Fall farm tour","classDescription":"Jelli's is a family-run \"You-pick\" farm. They grow everything from corn and asparagus to strawberries, blueberries, apples and pumpkins. \n\nThis is for ALL AGES.\n\nWe will go on a \"fall fun tour.\" Learn about apple and pumpkin production on the farm, see how they harvest and store fall produce, pick your own apples, meet the farm animals, participate in fall activities and games!\n\n$7/participant, chaperones are free unless they also want to pick apples. When you register please list number of participants who will be picking, fees will be collected based on this number.\n\nEach participant will receive a small bag of apples to take home. Optional $2 extra for a mini pumpkin pie (pay on-site, not with CIRCLE registration) There is also a farm store where they sell produce, baked goods, and other items for purchase if you wish.","displayLocation":"N5648 S Farmington Rd. Helenvillle, WI 53137","address":"N5648 S Farmington Rd., Helenville, WI 53137","latitude":"43.04695877520796", "longitude":"-88.67058287691944","date":"2023-10-03T00:00:00.000Z","startTime":"1899-12-30T10:30:00.000Z","endTime":"1899-12-30T12:30:00.000Z","repeats":"No","classMinimum":"3 participants","classMaximum":"None","fee":"$7 each participant, chaperones or littles who are not picking are free.","supplies":"Wear appropriate clothing, shoes, and sun protection for the outdoors. Feel free to bring a picnic lunch for after if you care to hang out."},{"classTitle":"Dragons Love Tacos and So Do We!","classDescription":"Who doesn't like tacos?! October 4th is National Taco Day and we're celebrating with tacos AND dragons! \nInspired by the kids' book \"Dragons Love Tacos\", we will have a taco potluck, make your taco however you like. We will also create some taco- and dragon-themed crafts. \n\nTo add to the fun, feel free to dress up in your favorite taco inspired outfit or dragon wings. I can provide dragon masks for those who are interested, it is an extra $3 fee. If you would like masks please include that on your registration.\n\nNOTE: This class is booked for two hours, but you are free to leave whenever is right for your family!","displayLocation":"Riverside Park Pavilion 700 Kilbourn Ave, West Bend, WI 53095","address":"700 Kilbourn Ave, West Bend, WI 530952","latitude":"43.417730391117956", "longitude":"-88.17041151493487","date":"2023-10-04T00:00:00.000Z","startTime":"1899-12-30T11:30:00.000Z","endTime":"1899-12-30T13:30:00.000Z","repeats":"No","classMinimum":"5 families","classMaximum":"None","fee":"$6/family (may be less depending on how many families sign up); OPTIONAL Dragon masks are available for $3","supplies":"Each family will bring one taco \"supply\" such a tortillas, cheese, meat, etc. Sign up will be sent separately in September."},{"classTitle":"Ninja Gym in Menomonee Falls","classDescription":"Join us at Legacy Falls for a one-hour kids ninja obstacle course. This gym has 2 locations and both will be offered as separate events this session. The Legacy Falls location tends to cater to a slightly older age in terms of obstacle layout. Recommended for ages 7 and up.\n\nKids need to wear socks and athletic shoes (no crocs, slides, sandals, etc)\n\nLegacy Gym is a functional fitness gym meant for people from all walks of life to come together and connect through fitness, good times, and positive energy. Ninja parties include an obstacle course, running wall, and a coach available to support the kids.","displayLocation":"Legacy Gym MKE - Legacy Falls N50W13740 Overview Dr suite e, Menomonee Falls, WI 53051","address":"N50W13740 Overview Dr, Menomonee Falls, WI 53051","latitude":"43.11014596229029", "longitude":"-88.08250836593227","date":"2023-10-04T00:00:00.000Z","startTime":"1899-12-30T13:30:00.000Z","endTime":"1899-12-30T14:30:00.000Z","repeats":"No","classMinimum":"16 participants","classMaximum":"19 participants","fee":7,"supplies":"gym clothes, athletic shoes and a water bottle"},{"classTitle":"Book Discussion ~ Red + Blue = Purple","classDescription":"Every year, I try to give my kids (now ages 7 & 7!) one of those \"beginning of the school year\" quizzes about their likes / dislikes. What are their preferences for this year, and how are those preferences different from the previous year?\n\nIf you are like me, sometimes the discussion doesn't happen until latitudeer in the year (such as October 5!).\n\nClass Description: We will read I Love You the Purplest by Barbara M. Joosse. Then, either on their own or with your help (depending on dictation / writing skills), your kid(s) will answer questions. Questions as basic as: What is your (current) favorite food? To more complicated questions such as: What is your goal for this year? (We will discuss some of the ideas ~ favorite summer adventure and favorite autumn activity ~ and others will be answered individually)\n\nAfterwards, there is a lovely paved walking path and / or a playground. We will be enjoying a picnic lunch, though you may leave whenever you choose. \n\nThe class is located at Fox Brook Park, which requires either a daily fee or a yearly pass for the Waukesha County Park System.","displayLocation":"Fox Brook Park, 2925 N Barker Rd, Brookfield, WI 53045","address":"2925 N Barker Rd, Brookfield, WI 53045","date":"2023-10-05T00:00:00.000Z","startTime":"1899-12-30T11:30:00.000Z","endTime":"1899-12-30T13:00:00.000Z","repeats":"No","classMinimum":"minimum one family","classMaximum":"maximum 20 attendees","fee":"no fee collected by CIRCLE; a park pass is required (paid to Waukesha County Park System)","supplies":"no supplies","latitude":"43.0737426","longitude":"-88.16942956328057"},{"classTitle":"TWEEN/TEEN Knit & Crochet Hang Out","classDescription":"Come hang out, have fun, bring your knitting and crochet supplies. Let's talk and make some time to work on those projects! Make sure to bring some money if you want to buy something yummy from the coffee shop, younger siblings can hang out with parents. If you're new to knitting/crochet just contact us in advance and we can bring some extra supplies for you to practice with. For those who like to crochet there will be a granny square exchange in latitudee November as well so come work on your granny squares. We will hold this class 2 times but they are independent events.","displayLocation":"Blüm Coffee Garden, 4930 W Loomis Rd, Greenfield, WI 53220","address":"4930 W Loomis Rd, Greenfield, WI 53220","date":"2023-10-05T00:00:00.000Z","startTime":"1899-12-30T13:00:00.000Z","endTime":"1899-12-30T15:00:00.000Z","repeats":"No","classMinimum":"Min 4","classMaximum":"None","fee":"None","supplies":"Your favorite knit and crochet supplies.","latitude":"42.9536441","longitude":"-87.97733093098472"},{"classTitle":"Discovery World","classDescription":"Explore the mind-blowing kids and family activities at the Discovery World science and technology museum in Milwaukee. \n\nWe will meet at 10am and enjoy the museum at your leisure until the museum closes at 4pm. We have a lunch room reserved for 12 noon for 25 minutes to eat lunch together as a group, if you choose. Bring a cold lunch for your group if you choose. There are Kulture City kits available to rent for free for students with sensory needs such as headphones and fidgets.\n\nPrice is $8 for students and $9 for adults. For every 10 paying students we will receive 1 free adult ticket.","displayLocation":"500 N Harbor Dr, Milwaukee, WI 53202","address":"500 N Harbor Dr, Milwaukee, WI 53202","date":"2023-10-05T00:00:00.000Z","startTime":"1899-12-30T10:00:00.000Z","endTime":"1899-12-30T16:00:00.000Z","repeats":"No","classMinimum":"10 paying students","classMaximum":"None","fee":"$8 students $9 adults","supplies":"None","latitude":"43.0369136","longitude":"-87.89613819925185"},{"classTitle":"Fall Hike and Scavenger Hunt","classDescription":"We'll meet at the parking lot for the Glacial Blue Hills Natural Area and hike through the hills in the fall woods. There will be a scavenger hunt sheet available for multiple ages of kids, and multiple trail distances to \"choose your own adventure.\"","displayLocation":"3526-3578 Beaver Dam Rd, West Bend, WI 53090","latitude":"43.444153745201675", "longitude":"-88.21328536489612","address":"3526-3578 Beaver Dam Rd, West Bend, WI 53090","date":"2023-10-05T00:00:00.000Z","startTime":"1899-12-30T10:30:00.000Z","endTime":"1899-12-30T12:00:00.000Z","repeats":"No","classMinimum":"None","classMaximum":"None","fee":"None","supplies":"None"},{"classTitle":"Graveyard hike at Seminary Woods","classDescription":"Crunch some leaves, spy some wildlife, navigate some trails. Seminary Woods, adjacent to the St Francis de Sales Seminary since 1855, is 68 acres of beech and maple woodland. It is home to white-tail deer, birds, and the endangered blue-stemmed goldenrod. There is a hidden cemetery a short walk in from parking where we will try to find the oldest grave marker (respectfully, of course).\nWe plan to walk rain or shine. Maybe not downpour rain. But it can get muddy and some kids love to play in the creek so prepare for all possible conditions.\nParking directions will be sent closer to the day of the hike.","displayLocation":"Near S Kinnickinnick Ave and E Morgan Ave, St Francis, WI","latitude":"42.98109922476455", "longitude":"-87.87959482306354","address":"S Kinnickinnick Ave and E Morgan Ave, St Francis, WI","date":"2023-10-06T00:00:00.000Z","startTime":"1899-12-30T13:00:00.000Z","endTime":"1899-12-30T14:30:00.000Z","repeats":"No","classMinimum":"1 student","classMaximum":"10 families","fee":"None","supplies":"None"},{"classTitle":"Soccer Skills","classDescription":"Join us for a soccer skills class and a mini-tournament! My husband is a child soccer coach, and has been for 13 years! He will lead everyone in a basic soccer skills class- this can be about 30 minutes to an hour long. Once everyone has a clear grasp on the basics, he will help instruct a game! \n\nThis class will be best suited for children ages 5-9. However, if you feel like your child (younger or older) would be able to participate and enjoy it- feel free to come! If enough younger siblings come, they can kick around a ball on the soccer field next to the one the class will be held at!","displayLocation":"Estabrook Park Soccer Field in Shorewood (Located on the opposite end of the beer garden)","address":"201-299 W Hampton Ave, Milwaukee, WI 53217","date":"2023-10-06T00:00:00.000Z","startTime":"1899-12-30T14:00:00.000Z","endTime":"1899-12-30T16:00:00.000Z","repeats":"No","classMinimum":8,"classMaximum":20,"fee":0,"supplies":"No needed- but a soccer ball would be helpful so your child can participate in a warm up circle prior to the game!","latitude":"43.1040626","longitude":"-87.9133699"},{"classTitle":"Get Your Stuff Done Parents!","classDescription":"Do you need a little help getting those things you keep putting off done? If you can bring it to the library - then come and get it done with us! Whether it's scheduling things online, prepping your curriculum, organizing your papers - anything you've been putting off, come join me and get it done! We'll use the power of body doubling to motivate and hold each other accountable. \n\nThe library has free wi-fi so you can use that to access the internet if needed (there are some devices to check out if you have a library card, but I can't guarantee availability - feel free to bring your own device if you have one). We are allowed to bring light refreshments, so bring a snack to share. I'll provide platitudees and napkins. \n\nI have the space reserved for 3 hours, but feel free to only come for part of the time if the whole time doesn't work. \n\nPermission to use a library space does not imply library endorsement of the aims, views, policies, or activities of any group or organization.Upon reasonable notice, efforts will be made to accommodate the needs of individuals with disabilities. For more information or to request accommodations, contact me using the contact info below.","displayLocation":"Good Hope Library - 7715 W. Good Hope Road Milwaukee, WI 53223","address":"7715 W. Good Hope Road, Milwaukee, WI 53223","date":"2023-10-07T00:00:00.000Z","startTime":"1899-12-30T12:30:00.000Z","endTime":"1899-12-30T15:30:00.000Z","repeats":"No","classMinimum":3,"classMaximum":7,"fee":"None","supplies":"Snack to share, whatever you need to work on","latitude":"43.1483705","longitude":"-88.0076914"},{"classTitle":"Kids Disc Golf","classDescription":"Join us for learning to play disc golf. Designed for ages 7 and up, we will give you instruction, tips, and practice using discs and baskets we will supply. Every student enrolled will receive 1-2 used discs they can take home. \n\nThe address listed is our home, which is across the street from Greene Park, where you will see baskets and a practice net set up when you arrive. Plenty of parking is available on the street.","displayLocation":"Greene Park - 4256 S Kingan Ave, St Francis, 53235","address":"4256 S Kingan Ave, St Francis, 53235","date":"2023-10-07T00:00:00.000Z","startTime":"1899-12-30T15:00:00.000Z","endTime":"1899-12-30T17:00:00.000Z","repeats":"No","classMinimum":"6 students","classMaximum":"12 students","fee":"Approx $2/student Price is for shipping of discs only. To be determined by number of students enrolled.","supplies":"Wear athletic shoes. Consider insect repellant.","latitude":"42.966977299999996","longitude":"-87.86228626301244"},{"classTitle":"Feral Kids Camping - Fall Edition","classDescription":"If you've never camped before or have backpacked through the mountains, this is for you. Come relax and camp with CIRCLE friends Kettle Moraine State Forest - Pike Lake Unit as our children run \"feral\" through the woods. Some gear is available to be borrowed from CIRCLE Families. \n\nHere's how this works. \n\nReserve your site directly through https://wisconsin.goingtocamp.com/ Kettle Moraine State Forest - PIke Lake Unit > Campground. \n\nThis is purposely scheduled at the same time as other activities in the Kettle Moraine State Forest - Pike Lake Unit. Signing up for this, you are signing up for camping and a nightly (optional) group bonfire. \n\nYou may also choose to sign up for or host other CIRCLE activities hosted in the Kettle Moraine State Forest - Pike Lake Unit separately during this time frame. \n\nPlease note that the official dates are October 9th - 11th yet many families reserve a longer time frame or choose to come for the day.","displayLocation":"Pike Lake State Park Campground, Hartford, WI 53086","address":"3585 Kettle Moraine Scenic Dr, Slinger, WI 53086","latitude":"43.31987532514953", "longitude":"-88.31950432180714","date":"2023-10-09T00:00:00.000Z","startTime":"1899-12-30T15:00:00.000Z","endTime":"1899-12-30T15:59:00.000Z","repeats":"seasonally","classMinimum":"1 family","classMaximum":"None","fee":"Class Fees: None through CIRCLE - you are responsible for reserving your own campsite, state park sticker, and food for the event.","supplies":"Class Supplies: A campsite reserved through the state park reservation system, state park sticker, camping equipment, etc."},{"classTitle":"Stabbing Things in the Woods (a fiber arts workshop)","classDescription":"All ages, tween-led class during Feral Kids Camping. \n\nBring your stabbing projects - needle felting, knitting, crocheting, or any other craft around a campfire project. Hot water will be available for tea and coffee BYOCC (bring your own cup and chair) \n\nAre you stuck on a project or a fiber arts noob? Colleagues will be there to get you unstuck. \n\nDid you sign up for the granny square swap and need some dedicated time to work on the squares? Come and chat.\n\nSugar Maple School's Rule 2 must be followed. Rule 2 is no bleeding.","displayLocation":"Pike Lake State Park Campground, Hartford, WI 53086","latitude":"43.319929966439645", "longitude":"-88.31959015059891","address":"3585 Kettle Moraine Scenic Dr, Slinger, WI 53086","date":"2023-10-09T00:00:00.000Z","startTime":"1899-12-30T15:00:00.000Z","endTime":"1899-12-30T16:30:00.000Z","repeats":"No","classMinimum":"None","classMaximum":"None","fee":"None","supplies":"Bring your stabbing projects - needle felting, knitting, crocheting, or any other craft around a campfire project. Mug for tea/coffee. Chair. \n\nVehicle needs a state park sticker."},{"classTitle":"Poe & Other Stories","classDescription":"Come for a spooky night of reading Edgar Allan Poe and other spooky stories around the campfire. We'll use \"Poe: Stories and Poems: A Graphic Novel Adaptation\" by Gareth Hinds for the reading. Copies are available on Amazon if you want to order a copy, but that is not necessary. \n\nThis night is open to all ages, but parents should determine if Poe and other spooky/horror authors are appropriate for their child. Kiddos may choose to read, tell stories, but are not required to read out loud. \n\nBYO.... chairs and campfire desserts if you'd like. \n\nIf you are not camping, you'll be required to leave the campground before 11pm.","displayLocation":"Pike Lake State Park Campground, Hartford, WI 53086","latitude":"43.31998460651277", "longitude":"-88.31962233500226","address":"3585 Kettle Moraine Scenic Dr, Slinger, WI 53086","date":"2023-10-09T00:00:00.000Z","startTime":"1899-12-30T21:00:00.000Z","endTime":"1899-12-30T22:00:00.000Z","repeats":"No","classMinimum":"None","classMaximum":"None","fee":"None","supplies":"State park sticker for your vehicle, chairs for around the campfire, stories to tell"},{"classTitle":"With Lots of Love Book Club","classDescription":"Join us for another Terra Kids Book Club Add-on! \n\nThis time we will be reading With Lots of Love by Jenny Torres Sanchez. With Lots of Love is a story about a girl who has moved to the United States from her home in Central America, away from everything she leaves behind and longs for- especially her Abuela. Rocio does her best to adjust to a new way of living, but there are many things she misses from her old life – Abuela’s cooking, Abuela’s piñata creations, Abuela’s warm hugs, and of course, Abuela herself most of all. But Abuela finds a way to send Rocio something special just in time for her birthday – a gift wrapped with lots of love – and that fills Rocio to the brim. The themes of familial relatitudeionships, food, celebrations, and connecting with loved ones over long distances in With Lots of Love will be sure to inspire and comfort young children and families all year long!\n\nThis book selection is this year's Jumpstart's Read for the Record! Jumpstart’s Read for the Record is the world’s largest shared reading experience and celebrates and supports children’s early language and social-emotional development. Over 26 million people have participated - and this is CIRCLE's chance to be a part of it! Because this is a Jumpstart Read for the Record book, I do have the option to order special edition copies at a discount - please indicate if and how many you would like. If we order enough copies, they will be even cheaper. \n\nAfter we read our story, we will discuss the book as well as parts of the story and our favorite foods and important people. We will also learn how to write letters (or draw pictures for younger kids) and how to address and stamp an envelope. I will provide the stamps and envelopes and even mail them when we leave class! Parents, I suggest you bring addresses so your child can practice writing the address (or you can show them how you would put it on an envelope, for pre-writers). We may do a few other fun activities relatitudeed to the book as well. \n\nThis class overlaps with Terra Kids, but is open to anyone. Last time it worked really well to have kids enjoy their lunch or a snack while we read.","displayLocation":"8200 W County Line Rd. Mequon, WI 53097","address":"8200 W County Line Rd. Mequon, WI 53097","date":"2023-10-09T00:00:00.000Z","startTime":"1899-12-30T11:30:00.000Z","endTime":"1899-12-30T12:30:00.000Z","repeats":"No","classMinimum":"5 students","classMaximum":"No maximum","fee":"$1 per student for stamps and envelopes; optional: $12 per book","supplies":"Optional: Clipboard or hard writing surface","latitude":"43.1925589","longitude":"-87.9892628"},{"classTitle":"Monstrous Masks","classDescription":"This class will be taking place during the Feral Kids camping trip. Spooky season is upon us, so we will be making masks using plaster gauze and learning a bit about the history of Halloween masks. If you don't celebrate the season that's fine- make a mask for pretend play or theatrics! I will have the supplies to make masks. If the kids want a challenge they can pair up with a partner and help each other make a custom fit mask with the plaster gauze, using petroleum jelly as a release agent. If putting plaster on their faces weirds them out they can use a foam head model. And for younger/ less adventurous kiddos I will have premade masks to decorate. I will have all basic supplies to make and decorate the masks, but if you have anything specific you want to decorate with like cool fabric/ feathers/ etc etc feel free to bring it and get extra creative. The initial mask making session will be scheduled for 2 hours, but if it takes you longer to create you can take as much time as needed or even come back the following day to finish up you final details.","displayLocation":"Pike Lake Campground","latitude":"43.319937772082305", "longitude":"-88.31959015026735","address":"3585 Kettle Moraine Scenic Dr, Slinger, WI 53086","date":"2023-10-09T00:00:00.000Z","startTime":"1899-12-30T12:00:00.000Z","endTime":"1899-12-30T14:00:00.000Z","repeats":"No","classMinimum":2,"classMaximum":15,"fee":5,"supplies":"Supplies will be provided, but participants are encouraged to think about what they would like to create and bring items to make that a reality. Examples- I want to make a bird-man mask so I bring some fun feathers to attach around the eyes of my mask. I want to make a bug mask and I might bring wire for my antennas, etc."},{"classTitle":"Board Games & Bonfire","classDescription":"Let's play board games around the bonfire at the Pike Lake Unit of Kettle Moraine State Forest. \n\nFeel free to use the bonfire to cook with sticks or pudgy pies for an easy dinner.","displayLocation":"Pike Lake State Park Campground Hartford, WI 53086 I","address":"3585 Kettle Moraine Scenic Dr, Slinger, WI 53086","latitude":"43.31987532489661", "longitude":"-88.3194935929188","date":"2023-10-09T00:00:00.000Z","startTime":"1899-12-30T17:00:00.000Z","endTime":"1899-12-30T20:00:00.000Z","repeats":"No","classMinimum":5,"classMaximum":"None","fee":"None","supplies":"We have some board games, chairs, tables, and sticks. We do not have pudgy pie irons. \n\nFeel free to bring board games, chairs, pudgy pies, things to cook over the fire, etc. \n\nVehicles require a state park sticker."},{"classTitle":"Eeee!! Ahh!!! Uhhhh??!","classDescription":"Taking place during 'Feral Kids' camping, dare, if you will, to let your imagination run wild with some crazy sensory exploration. Kids will place a hand in covered boxes, feeling what craziness awaits inside and write down their guesses at each box. Parents can help with the writing - this is low key! Contents will be revealed after everyone's done exploring the boxes. We're going for squeals of surprise, delight or disgust and some good laughs. All ages welcome! This is our own, non-violent, no scare spin off of the longstanding Halloween game, \"Dead Man\" because, you know, violence and the terrifying poem/story that goes with it doesn't comply with our policies or appeal to all the ages. \n\nThere will not be anything living inside the boxes, nothing vulgar or dangerous, nor anything containing gluten. If you have a child/children with specific allergies, please feel free to contact me before signing up to discuss contents (contents haven't been finalized as of yet). Hand sanitizer and paper towel will be available and there are bathrooms on-site that, should, still be open. \n\nWe'll set up on some picnic tables near the main beach and should there be inclement weather, we'll either move to an available shelter near the beach or reschedule. There is a playground at the beach, beautiful hiking trails and even some geocaches around!\n\n$2 per participating kid to cover supplies. A state park sticker or daily pass will be needed to enter the park; passes are available at the DNR Station near the entrance at the state park just off of Hwy 60.","displayLocation":"Pike Lake State Park - 3585 Kettle Moraine Scenic Dr, Slinger, WI 53086","latitude":"43.31992996619514", "longitude":"-88.3195794217029","address":"3585 Kettle Moraine Scenic Dr, Slinger, WI 53086","date":"2023-10-10T00:00:00.000Z","startTime":"1899-12-30T14:30:00.000Z","endTime":"1899-12-30T15:30:00.000Z","repeats":"No","classMinimum":"3 Families","classMaximum":"None","fee":"$2 per participating kid to cover supplies. A state park sticker or daily pass will be needed to enter the park; passes are available at the DNR Station near the entrance at the state park just off of Hwy 60.","supplies":"None"},{"classTitle":"Cotton Candy for Breakfast","classDescription":"Because... why not? \n\nWe'll live spin cotton candy and hike the astronomy trail with all the random planes that \"van Amanda\" has in her basement.","displayLocation":"Pike Lake Campground","address":"3585 Kettle Moraine Scenic Dr, Slinger, WI 53086","latitude":"43.319922160819374", "longitude":"-88.31959015092744","date":"2023-10-10T00:00:00.000Z","startTime":"1899-12-30T09:00:00.000Z","endTime":"1899-12-30T10:00:00.000Z","repeats":"No","classMinimum":"None","classMaximum":"None","fee":"None","supplies":"State Park sticker for your vehicle"},{"classTitle":"Let's Paint Things","classDescription":"Let's paint some things - rocks, t-shirts, recycled canvas, or add some monsters to pictures from the thrift store. \n\nMaybe we'll even be able to volunteer to paint some picnic tables and benches at Pike Lake Unit of Kettle Moraine State Forest as a service project.","displayLocation":"Pike Lake State Park Campground, Hartford, WI 53086","address":"3585 Kettle Moraine Scenic Dr, Slinger, WI 53086","latitude":"43.31990654884035", "longitude":"-88.31955796491137","date":"2023-10-10T00:00:00.000Z","startTime":"1899-12-30T10:30:00.000Z","endTime":"1899-12-30T11:30:00.000Z","repeats":"No","classMinimum":5,"classMaximum":"none","fee":"None","supplies":"Bring supplies lying around in your basement to use personally or share. Vehicles will need a Wisconsin State Park sticker."},{"classTitle":"Pike Lake Sea & sky","classDescription":"This is held during Feral Kids Camping. \n\nCome explore the sea and sky with a nature exploration of the Pike Lake beach area. We'll find some picnic tables near the beach to set-up. This will be a weather and interest-dependent class where we see what we can find. We will bring tools like: nets, buckets, magnifying glasses, binoculars, bug jars. We'll bring our nature books, so we can learn more about anything we can identify. Recording findings in a nature journal will be encouraged, but not required.","displayLocation":"Pike Lake State Park - 3585 Kettle Moraine Scenic Dr, Slinger, WI 53086","address":"3585 Kettle Moraine Scenic Dr, Slinger, WI 53086","latitude":"43.320015827822864", "longitude":"-88.31956868914271","date":"2023-10-10T00:00:00.000Z","startTime":"1899-12-30T13:30:00.000Z","endTime":"1899-12-30T14:30:00.000Z","repeats":"No","classMinimum":"1 family","classMaximum":"none","fee":"none","supplies":"Curiosity for the natural world. Helpful but not required: Seek App on your device, binoculars, nets, buckets, magnifying glasses, bug jars, nature ID books, nature journal."},{"classTitle":"Autumn Tree Weaving","classDescription":"In this class we will take a hike and collect vines as well as freshly fallen autumn leaves. We will cut our vines and weave them into a circle. Then I will show you how to make a woven 'tree' out of yarn, wool roving, and leaves. I have loved using these as 'gratitude' trees to celebrate the season of gratitude in November, as the leaves you collect can be taken out and replenished through the autumn season. You don't have to stay for the whole class, but finishing the project does take some time and developing a sort of 'flow' with the handwork. You can take the yarn or wool you'd like and then finish it outside of the class as well.","displayLocation":"Pike Lake North Pavillion","address":"3585 Kettle Moraine Scenic Dr, Slinger, WI 53086","latitude":"43.31995338381009", "longitude":"-88.31961160740737","date":"2023-10-11T00:00:00.000Z","startTime":"1899-12-30T13:00:00.000Z","endTime":"1899-12-30T16:00:00.000Z","repeats":"No","classMinimum":1,"classMaximum":50,"fee":"$3/student","supplies":"I will provide materials for class."},{"classTitle":"Hot Wheels Science: Exploring Force and Motion","classDescription":"Let's explore beginning physics concepts of force and motion through play using Hot Wheels cars and tracks! \n\nGeared Towards kids 5-9, but open to any age (you know your kid best). \n\nMeet at Upper Lake Park picnic area 5 (across from Possibility Playground) in Port Washington. Stay to play/explore the playground or park after if you'd like!","displayLocation":"Upper Lake Park, 498 N Lake St, Port Washington, Wisconsin 53074","address":"498 N Lake St, Port Washington, Wisconsin 53074","date":"2023-10-12T00:00:00.000Z","startTime":"1899-12-30T10:30:00.000Z","endTime":"1899-12-30T12:00:00.000Z","repeats":"No","classMinimum":"3 students","classMaximum":"16 students","fee":"None","supplies":"None","latitude":"43.391235","longitude":"-87.8662423"},{"classTitle":"A Mom Teaching Other Parents to Knit Session #2","classDescription":"Grab your yarn balls, some pointy stick things, and join me to learn to knit. You've all been asking, and I'm delivering! \n\nThis class is meant for adults who don't know how to knit, or who would like to get better. (If you're an experienced knitter, feel free to join us at the meetups, but don't register. Save the seats for the newbies.) Babes in arms are welcome, but otherwise please leave the kiddos at home. \n\nI will walk you through the whole process from choosing needles and yarn, to casting on and binding off, and all the stitches in between. We will meet 3 times, and I'll be available via text or Marco Polo for help in between.\n\nYou will have 3 options for easy beginner projects, I'll provide the patterns and help you navigate them. Choose from:\n1. Cowl\n2. Scarf\n3. Hat\n\nThis class meets on 10/17, 10/24, and 11/6.\n\nI put the end time for 8pm because the library closes then, but you may leave earlier if you need to.\n\n**NOTE the 3rd date for this class is on a Monday**\n\n** This class will be offered in two different sessions, each is 3 classes. Feel free to sign up for just one session, or both. They will be listed separately on the form. **","displayLocation":"Germantown Community Library, N112W16957 Mequon Rd, Germantown, WI 53022","latitude":"43.220411973084474", "longitude":"-88.11948346525568","address":"N112W16957 Mequon Rd, Germantown, WI 53022","date":"2023-10-17T00:00:00.000Z","startTime":"1899-12-30T18:30:00.000Z","endTime":"1899-12-30T20:00:00.000Z","repeats":"Same times, 10/24, 11/6","classMinimum":"2 knitters","classMaximum":"5 knitters","fee":"None","supplies":"Knitting needles and yarn. I will reach out via email to help you decide what you need based on your planned project."},{"classTitle":"Little Monsters Storytime at the Park","classDescription":"Have a little monster at home that loves stories being read to them? Tired of always reading the same book over and over? Have no fear, Lily (12) and I are here to give you a break! We will be reading a variety of our family favorites to share with your family while we all enjoy the outdoors!","displayLocation":"Riverside Park, near the purple playground, 700 Kilbourn Ave, West Bend, WI 53095","address":"700 Kilbourn Ave, West Bend, WI 53095","date":"2023-10-18T00:00:00.000Z","startTime":"1899-12-30T10:30:00.000Z","endTime":"1899-12-30T11:30:00.000Z","repeats":"No","classMinimum":"No minimum","classMaximum":"20 maximum","fee":"None","supplies":"None","latitude":"43.41752","longitude":"-88.16976640318188"},{"classTitle":"Nocturnal Flyers at the Mequon Nature Preserve","classDescription":"Due to their nocturnal lifestyle, owls and bats have some of the most unique survival adaptations. An indoor lesson will cover the incredible physical and behavioral specialties of both bats and owls that allow them to navigate the night skies, as well as their benefits to humans. This lesson culminates with a dissection of real owl pellets! An outdoor hike will take the group to a forest that hosts resident great horned owls as well as numerous bats.\n\nThis program is being offered for free by the Mequon Nature Preserve to the homeschool community at large. Once I know how many participants we have from CIRCLE, I will coordinate with the Nature Center's educator. Afterward, I will have a more exact details which I will communicate to the group (the time listed on their website may include a lunch break, etc). People signing up should keep in mind that since we may be participating with other homeschool groups I can't guarantee that others will follow CIRCLE guidelines.","displayLocation":"Mequon Nature Preserve, 8200 County Line Road, Mequon, WI 53097","latitude":"43.19342672333664", "longitude":"-88.01025222172001","address":"8200 County Line Road, Mequon, WI 53097","date":"2023-10-18T00:00:00.000Z","startTime":"1899-12-30T10:00:00.000Z","endTime":"1899-12-30T13:00:00.000Z","repeats":"No","classMinimum":"Min 4","classMaximum":"None","fee":"None","supplies":"None"},{"classTitle":"Neverending Game of Tag","classDescription":"Join CIRCLE friends at Kayla's Playground (3723 W Puetz Rd, Franklin, WI 53132) for year three of the Neverending Game of Tag. \n\nEach week the game time will be active from 11:00am to 12:30pm and may include themed versions of tag in addition to regular tag. \n\nPlayers will wear a bandana to show they are actively playing and may take breaks from the game by removing their bandana. The bandana will not be removed by other players. \n\nClass will be canceled in the event of weather that can kill you: forecasted hypothermia and/or damaging winds/ tornadoes /dangerous lightning. \n\nWe will play in light rain & snow.\n\nPlease commit to at least one day of Neverending Game of Tag when signing up for this event.\n\nPlease note: This event is teen-led, parent supported.","displayLocation":"Kayla's Playground (3723 W Puetz Rd, Franklin, WI 53132)","address":"3723 W Puetz Rd, Franklin, WI 53132","date":"2023-10-19T00:00:00.000Z","startTime":"1899-12-30T11:00:00.000Z","endTime":"1899-12-30T12:30:00.000Z","repeats":"weekly","classMinimum":"5 participants","classMaximum":"None","fee":"None","supplies":"Bandana, water / coffee, snacks and comfy chairs for moms,","latitude":"42.8860414","longitude":"-87.9633559"},{"classTitle":"Halloween Story Time and Dance!","classDescription":"Join us for a spooktacular story time and dance party at Centennial Park in Grafton. We will plan to use the pavilion, but please bring lawn chairs, just in case. Wear your Halloween costume if you feel like it (this is optional), dress for the weather, and bring your dancing shoes! For ages 7 and under.","displayLocation":"Centennial Park, 1470 17th Ave, Grafton, Wisconsin 53024","address":"1470 17th Ave, Grafton, Wisconsin 53024","date":"2023-10-20T00:00:00.000Z","startTime":"1899-12-30T10:00:00.000Z","endTime":"1899-12-30T10:45:00.000Z","repeats":"No","classMinimum":"Minimum 6 students","classMaximum":"Maximum 10 students","fee":"None.","supplies":"None.","latitude":"43.31693294004273","longitude":"-87.94496411203268"},{"classTitle":"Symphony in Space!","classDescription":"Join the Milwaukee Symphony Orchestra in a galaxy far, far away as we explore music inspired by the mysteries of the universe. Movements from Gustav Holst’s masterwork The Planets will be complemented by John Williams’s iconic Main Theme from Star Wars and much more. The sun, moon, stars, and planets will align in this celestial symphonic celebration!\n\nThis show is designed for grades 3rd - 8th and lasts approximately 45 minutes. Concerts for Schools are not recommended for those under age 3. \n\nThe 10:15 time is very popular. In the event that the 12 pm time slot fills before CIRCLE registration closes, we will attempt for the 12 pm show on either 10/26 or 10/31. A switch will be clearly communicated and refunds offered for anyone who can not make the date. Plan to arrive about 30 minutes early (the class start time is set to this time) so we can collect our group - more information about meeting place will be sent to you via email before the concert. \n\nThe MSO provides a teacher's resource guide ahead of the performance and this will be shared with you in case you desire to incorporate some of the activities into your homeschool. \n\nAccessibility: The Bradley Symphony center does have accessible seating as well as being equipped with a tele-coil or T-coil Loop system. Assistive listening devices, sensory bags, weighted lap pads, and noise canceling headphones are also available upon request. I will send an email after registration closes to collect information on any accessibility needs.","displayLocation":"Allen-Bradley Hall 212 West Wisconsin Avenue, Milwaukee 53203","address":"212 West Wisconsin Avenue, Milwaukee 53203","date":"2023-10-25T00:00:00.000Z","startTime":"1899-12-30T11:30:00.000Z","endTime":"1899-12-30T13:00:00.000Z","repeats":"No","classMinimum":"5 participants","classMaximum":"No max","fee":"$6 per ticket","supplies":"None","latitude":"43.039248549999996","longitude":"-87.91340077821192"},{"classTitle":"Book Explorers/Library Hangout","classDescription":"Come to the Wauwatosa Public Library for Book Explorers with librarian Anne Kissinger and a library hangout for everyone else!\n\nDuring this session of Book Explorers we will look at different cook books and why we would check one out over the other. How do the cookbooks particular structure serve its purpose successfully? How is a cookbook adapted to its particular readers? \n\nIf you have attended this program before, you already know that we like to hear about books and often take other people's suggestions. Please bring a book that you have already read or currently reading (does not have to fit with the theme each meeting) to tell us a little bit about it. \n\nEach Book Explorers will begin with a short oral story and end with an activity.\n\nImportant: You must pre-register for this event on the library website in addition to signing up through CIRCLE. A reminder email will be sent out to those who sign up for this class.\n\nhttps://www.wauwatosalibrary.org/kids/program-registration","displayLocation":"Wauwatosa Public Library, 7635 W North Ave Wauwatosa, WI 53213 United States","address":"7635 W North Ave, Wauwatosa, WI 53213 United States","date":"2023-10-26T00:00:00.000Z","startTime":"1899-12-30T10:30:00.000Z","endTime":"1899-12-30T11:30:00.000Z","repeats":"No","classMinimum":"none","classMaximum":"12 Book Explorers participants; no maximum Library Hangout participants","fee":"none","supplies":"Please bring a book that you have already read or currently reading (does not have to fit with the theme each meeting) to tell us a little bit about it.","latitude":"43.06065978490761","longitude":"-88.00809176591339"},{"classTitle":"Magic Willows Alpacas Farm","classDescription":"This class is geared towards any age, and all can share in the Alpaca love at Magic Willows Alpacas!\nPlease note: this is a working farm so we ask you to be cognizant of outer wear and footwear. In the event of rain, we will likely reschedule our time on the farm. \n\nWe’ll spend the morning with a guided tour with the farm owners, exploring the farm, feeding alpacas in the pasture and learning about animal care. There is a farm store that will be open with farm fresh eggs chicken and duck, $4.25/$8/dozen. \n\nThis field trip is for any and all, parents and babes in arms are free. $8/child, please list children’s ages next to names in registration.","displayLocation":"Magic Willows Alpaca Farm: 6340 Arthur Rd, Hartford, WI 53027","address":"6340 Arthur Rd, Hartford, WI 53027","date":"2023-10-27T00:00:00.000Z","startTime":"1899-12-30T10:00:00.000Z","endTime":"1899-12-30T11:30:00.000Z","repeats":"No","classMinimum":"Minimum 6","classMaximum":"Maximum 20","fee":"$8/child","supplies":"None","latitude":"43.35382847340974","longitude":"-88.35048284383275"},{"classTitle":"The Gathering of the Gourds","classDescription":"You're invited to our first Gathering of the Gourds! \n\n**This is a supplemental activity, not a standard class.**\n\nAs a family unit, or as individual family members, you'll carve pumpkins at home and then bring them to display during our Halloween party at Homestead Hollow. The wackier the better. Your pumpkins can be carved, decorated or a combo of both. I'll supply LED candles. We'll display all of the pumpkins and everyone attending the party will be asked to vote on different categories. It's all in good fun - not intended to be super competitive. \n\n***CATEGORIES***\n\n*\"My first pumpkin\" award\n*Spookiest\n*Silliest\n*Most Creative\n*Best Dressed\n*Best 'wow' Factor\n*Best Pop Culture Reference\n\nPlease aim for delivering your pumpkins to the display site by 5:30pm. Earlier is okay. If you can't make it until latitudeer, that's okay too! We'll take a group photo around 7pm. Be sure to depart the event with your pumpkins in hand so that we keep the site clean.","displayLocation":"Homestead Hollow County Park N120W19809 Freistadt Rd, Germantown, WI 53022","latitude":"43.234658372888", "longitude":"-88.15535840679962","address":"N120W19809 Freistadt Rd, Germantown, WI 53022","date":"2023-10-27T00:00:00.000Z","startTime":"1899-12-30T17:00:00.000Z","endTime":"1899-12-30T19:00:00.000Z","repeats":"No","classMinimum":"5 participants","classMaximum":"None","fee":"None","supplies":"carved pumpkins"},{"classTitle":"VIRTUAL: NaNoWriMo National Novel Writing Month","classDescription":"Open to all ages. \n\nTake the NaNoWriMo Challenge to write a whole story in one month. We'll break it down and workshop together virtually encouraging one another along the way. \n\nHow age, grade, and writing ability come together for you is unique to you (your student). \n\nSession 1: Overview & Goal-Setting\nWe'll chat through the Elementary level workbook, and set some goals. \n\nhttps://ywp.nanowrimo.org/pages/word-count-goal-how-to\nhttps://ywp.nanowrimo.org/pages/learning-resources\n\nSession 2: Workshop\nCome with questions that you might have about your novel writing process. We'll celebrate writing milestones. \n\nSession 3: Celebrate \nShare your stories and we'll video chat together to celebrate.","displayLocation":"Google Meet","date":"2023-10-30T00:00:00.000Z","startTime":"1899-12-30T10:30:00.000Z","endTime":"1899-12-30T11:30:00.000Z","repeats":"Every other week for 3 weeks.","classMinimum":2,"classMaximum":"None","fee":"None","supplies":"Writing supplies, virtual connection"},{"classTitle":"TWEEN/TEEN Knit & Crochet Hang Out","classDescription":"Come hang out, have fun, bring your knitting and crochet supplies. Let's talk and make some time to work on those projects! Make sure to bring some money if you want to buy something yummy from the coffee shop, younger siblings can hang out with parents. If you're new to knitting/crochet just contact us in advance and we can bring some extra supplies for you to practice with. For those who like to crochet there will be a granny square exchange in latitudee November as well so come work on your granny squares. We will hold this class 2 times but they are independent events.","displayLocation":"Blüm Coffee Garden, 4930 W Loomis Rd, Greenfield, WI 53220","address":"4930 W Loomis Rd, Greenfield, WI 53220","date":"2023-10-30T00:00:00.000Z","startTime":"1899-12-30T13:00:00.000Z","endTime":"1899-12-30T15:00:00.000Z","repeats":"No","classMinimum":"Min 2","classMaximum":"None","fee":"None","supplies":"Your favorite knit and crochet materials.","latitude":"42.9536441","longitude":"-87.97733093098472"},{"classTitle":"Fill the Trunk! Service Work Opportunity","classDescription":"Fill the Trunk! This is a service work opportunity to help those who are currently struggling. \nHelp us fill the trunk of our minivan full of blankets, personal hygiene items, clothing items, etc. \n\nMy family will deliver the items to Street Angels in Milwaukee. Street Angels is a mobile outreach organization assisting our neighbors without homes in bridging the gaps between homelessness and housing through support, advocacy and community collaboration. Founded in 2016 by two women who began voluntarily serving from the back of their cars, the organization has since grown to be a highly regarded leader in street outreach with two outreach buses serving 100-240 individuals three-nights per week. Street Angels has 3 Full-Time and 3 Part-Time staff members and an army of volunteers providing over 8,000 volunteer hours annually. \n\nIn 2022, Street Angels achieved: 156 Nights of street outreach, 510 unique individuals met & provided resources, 103 individuals connected to housing, 78 safe sleeps in a hotel for our most vulnerable neighbors who were unable to access shelter, 14,292 hot meals served, offered 27 shower days and 203 showers, distributed 627 harm reduction kits, 9 unique treatment support partnerships established, they offered 15,527 bag lunches for latitudeer, received over $300,000 In-Kind items donated and had 2,289 financial donors. \n\nThey're currently collaborating with Kohler to offer a mobile shower trailer by Spring, 2024. \n\nLet's help them reach more people! Please consider donating any of the items from their need list: https://www.streetangelsmke.org/donate \nTheir Amazon wish list can be found here: https://www.amazon.com/hz/wishlist/ls/28S5E62D9SDUW/ref=nav_wishlist_lists_1\n\nWe'll be meeting at the Village Park Play Area in Menomonee Falls - a new, inclusive play area. Feel free to stay and explore the new park, walk the trail or grab a treat from Fiddleheads across the street. Pop's Frozen Custard and the Garcarde are nearby if you're looking to make an afternoon out of it!","displayLocation":"Village Park - Menomonee Falls - N87W16749 Garfield Dr. Menomonee Falls","address":"N87W16749 Garfield Dr., Menomonee Falls, WI","latitude":"43.17546596255215", "longitude":"-88.11848991092944","date":"2023-11-01T00:00:00.000Z","startTime":"1899-12-30T12:30:00.000Z","endTime":"1899-12-30T13:30:00.000Z","repeats":"No","classMinimum":"4 Families","classMaximum":"None","fee":"None","supplies":"Please review the Street Angels website for items needed: https://www.streetangelsmke.org/donate\nPlease review the Street Angels' Amazon wish list for items needed:\nhttps://www.amazon.com/hz/wishlist/ls/28S5E62D9SDUW/ref=nav_wishlist_lists_1"},{"classTitle":"Toddlers to Teens Picnic at Kayla's Playground","classDescription":"Find your people before winter sets in. Bring a lunch and we'll eat and play together after tag.","displayLocation":"Kayla's Playground 3723 W Puetz Rd, Franklin, WI 53132","address":"3723 W Puetz Rd, Franklin, WI 53132","date":"2023-11-02T00:00:00.000Z","startTime":"1899-12-30T12:00:00.000Z","endTime":"1899-12-30T13:30:00.000Z","repeats":"No","classMinimum":"None","classMaximum":"None","fee":"None","supplies":"Lunch or snacks.","latitude":"42.8860414","longitude":"-87.9633559"},{"classTitle":"Happy 50th Birthday Hip-Hop","classDescription":"Join us as we celebrate the 50th birthday of Hip-Hop by learning of it's origins, the supporting pillars (with interactive activities), how it began, and how it has evolved over the last 50 years. \nThis will be a teen/pre-teen led class, with minimal parental involvement. \nParking is available in rear lot, metered street parking is available as well.","displayLocation":"Mitchell Street Library, Community Meeting Room906 W.Historic Mitchell Street, Milwaukee","address":"906 W. Historic Mitchell Street, Milwaukee, WI","date":"2023-11-03T00:00:00.000Z","startTime":"1899-12-30T11:00:00.000Z","endTime":"1899-12-30T12:30:00.000Z","repeats":"No","classMinimum":6,"classMaximum":25,"fee":"None","supplies":"None","latitude":"43.0124815","longitude":"-87.9231074"},{"classTitle":"West Allis Library Tour","classDescription":"Tour one of Milwaukee County's largest libraries: West Allis Public Library! On this guided tour, we will be allowed a behind-the-scenes visit to physical spaces normally off limits as we trace the circulatitudeory life cycle of a library book. Then we'll join forces for a scavenger hunt throughout the facility. No one will go home empty-handed and I hear they may have some pretty great swag bags for us... On the way out, visit the book sale shelves where you can walk away with great books for old-school low prices!\nWHEN SIGNING UP: \n1. Include the age of each student attending so we can tailor content to age groups represented. \n2. Include all adults attending so we can get a total head count for the tour. Adults will be welcomed as participants as well as the kiddos!","displayLocation":"West Allis Public Library, 7421 W National Ave, West Allis WI 53214","address":"7421 W National Ave, West Allis, WI 53214","date":"2023-11-06T00:00:00.000Z","startTime":"1899-12-30T10:00:00.000Z","endTime":"1899-12-30T11:00:00.000Z","repeats":"No","classMinimum":"No minimum","classMaximum":"No maximum.","fee":"None","supplies":"None","latitude":"43.0117901","longitude":"-88.00525863741993"},{"classTitle":"Story Slam at the Beach","classDescription":"We play this story game where we come up with multiple situations / back stories of how a police blotter or news story came to be. Let's try a CIRCLE appropriate version with battling teams. \n\nAnd to make it even weirder, let's do this at the beach in November. \n\nMaybe it will be 70. If it's super cold, we'll move it indoors in the general area of Oak Creek.","displayLocation":"Bender Beach 4503 E Ryan Rd, Oak Creek, WI 53154","address":"4503 E Ryan Rd, Oak Creek, WI 53154","date":"2023-11-06T00:00:00.000Z","startTime":"1899-12-30T13:00:00.000Z","endTime":"1899-12-30T14:30:00.000Z","repeats":"No","classMinimum":"8 people","classMaximum":"none","fee":"None","supplies":"Beach toys.","latitude":"42.87119673874812","longitude":"-87.84551299706591"},{"classTitle":"Animal Stories at Sharon Lynne Wilson Center","classDescription":"Come join us for a series of short Japanese animal stories acted out for kids, at Sharon Lynne Wilson Center for the Arts. This musical matinee will last just under an hour and is best for kids K5-2nd grade. \n\nThese retellings of traditional fables and folktales from Japan and Okinawa teach important lessons of persistence, respect and kindness. Japanese and Okinawan music, language and culture are the heart of this performance featuring clever animals, puppetry, live songs, Koto and Taiko instruments, and a whole lot of fun for young audience members and their families. The five stories featured in the performance are part of the tradition of Mukashibanashi, or the “tales of long ago,” and include The Carp Who Would Not Quit, The Mice and the Rolling Musubi, the legend of the Rabbits making Mochi in the Moon, and more!","displayLocation":"Sharon Lynne Wilson Center for the Arts, 3270 Mitchell Park Drive, Brookfield, WI 53045","address":"3270 Mitchell Park Drive, Brookfield, WI 53045","date":"2023-11-07T00:00:00.000Z","startTime":"1899-12-30T12:00:00.000Z","endTime":"1899-12-30T13:00:00.000Z","repeats":"No","classMinimum":8,"classMaximum":"-","fee":"$10 per ticket","supplies":"-","latitude":"43.074988","longitude":"-88.160148"},{"classTitle":"Tour of TWIGS Beverage","classDescription":"Tour - FREE\nAll ages\n\nIn 2015 they opened a glass bottled soft drink museum focused on Sun Drop and the history of Twig's Beverage. You will be able to watch live production, sample the sodas, watch multiple videos around the museum, experience vintage advertising, vending, and a mock up of an antique city street. On your way out you can stop in at the gift shop and pick up some cool Sun Drop merchandise!","displayLocation":"TWIGS Beverage, 920 S Franklin St, Shawano, WI","address":"920 S Franklin St, Shawano, WI","date":"2023-11-07T00:00:00.000Z","startTime":"1899-12-30T14:00:00.000Z","endTime":"1899-12-30T15:30:00.000Z","repeats":"No","classMinimum":"none","classMaximum":"none","fee":"free","supplies":"none","latitude":"44.77314190552597","longitude":"-88.61149541319828"},{"classTitle":"Sushi Making for Kids","classDescription":"Learn how to make fun and easy fresh sushi rolls or, maki, for the whole family. Maki means “to roll” in Japanese. It’s a type of sushi made using rice cooked with vinegar, salt, and sugar wrapped with a layer of black seaweed (nori). \n\nFor over a year, Ellie, age 12, has been making sushi rolls for her family using cooked sushi rice, vegetables, and seaweed. For this class, she will show you how to prepare your vegetables and assemble your ingredients to make about 6-8 rolls.\n\nNOTE: Please prepare your sushi rice ahead of the class and have all supplies ready with a clean prep surface to work on. We will tell you how to season your rice at the class. \n\nWe will go at a slow pace so no one will be confused or rushed.","displayLocation":"Google Meet","date":"2023-11-08T00:00:00.000Z","startTime":"1899-12-30T13:00:00.000Z","endTime":"1899-12-30T14:00:00.000Z","repeats":"No","classMinimum":"2 students","classMaximum":"None","fee":"None/Supplies purchased on your own","supplies":"Virtual connection for Google Meet\nSupplies needed: \n* Cook one cup of dry sushi rice (it will expand) according to package directions. DO NOT add anything to the cooked rice yet.\n* 1 tablespoon sugar\n* 1 teaspoon kosher salt\n* ¼ cup rice vinegar\n* vegetables such as your choice of cucumber, carrot, avocado\n* any protein you want such as fish, chicken, or cooked tofu (optional)\n* large sheets of nori. If you need ideas on where to purchase, let us know.\n* sauce for dipping (mayo and sriracha, or soy sauce, coconut aminos, etc)\n* large bowl\n* cutting board\n* sharp knife\n* bamboo roll or silpat mat to roll your sushi\n* spatula or spoon"},{"classTitle":"Party School: The Hobbit","classDescription":"Grab your best traveling cloak, your favorite walking stick, and join our party as we celebrate reading The Hobbit in Party School style!\n\nHere's how Party School works:\n1. Read this session's book (either as a family or individually)\n2. We party, with themed food and games to go along with the book!\n\nWe will decorate our own Elven maps, try and ring some dragon treasure, and eat cakes and goodies sure to please any hobbit. There will be games and activities for all! Party activities are will be focused on ages 6 to tweens, but all ages are welcome to join!\n\nWant to really get in the party spirit? Dress up in your best hobbit, dwarf or other Middle Earth themed costume! To stay within CIRCLE rules, costume swords and such are allowed but MAY NOT BE USED against anyone or anything during the party.\n(Please no orcs, wargs, or goblins, so no one has nightmares.)\n\nEach family is asked to bring a dish or snack to share. Please include a list of ALL ingredients in your dish if it's not packaged.\n\nSpecial Considerations :\n+ I made the event for 2.5 hours, but as always, please feel free to leave when it's right for your family.\n\n+ This event will be held in a church but the class is in no way influenced or associated with said church. It's just the location.","displayLocation":"Immanuel United Church of Christ, 501 Walnut St, West Bend, WI 53095","address":"501 Walnut St, West Bend, WI 53095","date":"2023-11-13T00:00:00.000Z","startTime":"1899-12-30T12:00:00.000Z","endTime":"1899-12-30T14:30:00.000Z","repeats":"No","classMinimum":"3 Families","classMaximum":"12 Families","fee":"$8/family","supplies":"A dish to share, and your own mug/cup for beverages (I'll have lemonade and ice tea available)\n\nOPTIONAL: Middle Earth inspired costumes or props","latitude":"43.422027","longitude":"-88.182544"},{"classTitle":"All About Leopard Geckos","classDescription":"Have you ever wondered what it might be like to have a leopard gecko as a pet? Come meet our little leopard gecko buddies, Pumpkin and Flash along with Sarah the dubia roach! You will learn all about their proper care, where they come from, what they eat, among other things! We will also have a lizard craft during the second half of the class as well to take home! This will be geared towards elementary aged kids but older and younger kids are welcome (please note though that geckos will appreciate calm hands and a reasonable noise level so keep this in mind when considering who would be best to attend). Please have kids wear long sleeves as they may have an opportunity to hold one of the geckos and they do have little claws.","displayLocation":"U.S.S. Liberty Memorial Public Library(children’s’ meeting roomIn lower level) 1620 11th Avenue Grafton, WI 53024","address":"1620 11th Avenue, Grafton, WI 53024","date":"2023-11-16T00:00:00.000Z","startTime":"1899-12-30T13:00:00.000Z","endTime":"1899-12-30T15:00:00.000Z","repeats":"No","classMinimum":2,"classMaximum":"15 students","fee":"None","supplies":"None","latitude":"43.31402025748373","longitude":"-87.95279245995336"},{"classTitle":"Cat Kid Comic Club","displayLocation":"West Bend Community Memorial Library, 630 Poplar St., West Bend, WI, 53095","address":"630 Poplar St., West Bend, WI, 53095","date":"2023-11-28T00:00:00.000Z","repeats":"No","classMinimum":5,"classMaximum":"None","fee":"$1/student","latitude":"43.42085416230238","longitude":"-88.18410283409678"},{"classTitle":"Book Explorers - November","classDescription":"Come to the Wauwatosa Public Library for Book Explorers with librarian Anne Kissinger and a library hangout for everyone else!\n\nIf you have attended this program before, you already know that we like to hear about books and often take other people's suggestions. Please bring a book that you have already read or currently reading (does not have to fit with the theme each meeting) to tell us a little bit about it. \n\nEach Book Explorers will begin with a short oral story and end with an activity.\n\nImportant: You must pre-register for this event on the library website in addition to signing up through CIRCLE. A reminder email will be sent out to those who sign up for this class.\n\nhttps://www.wauwatosalibrary.org/kids/program-registration","displayLocation":"Wauwatosa Public Library, 7635 W North Ave Wauwatosa, WI 53213 United States","address":"7635 W North Ave, Wauwatosa, WI 53213 United States","date":"2023-11-30T00:00:00.000Z","startTime":"1899-12-30T10:30:00.000Z","endTime":"1899-12-30T11:30:00.000Z","repeats":"No","classMinimum":"none","classMaximum":"12 Book Explorer participants; no maximum library hangout participants","fee":"none","supplies":"Please bring a book that you have already read or currently reading (does not have to fit with the theme each meeting) to tell us a little bit about it.","latitude":"43.06065978490761","longitude":"-88.00809176591339"},{"classTitle":"Book Explorers - December","classDescription":"Come to the Wauwatosa Public Library for Book Explorers with librarian Anne Kissinger and a library hangout for everyone else!\n\nIf you have attended this program before, you already know that we like to hear about books and often take other people's suggestions. Please bring a book that you have already read or currently reading (does not have to fit with the theme each meeting) to tell us a little bit about it. \n\nEach Book Explorers will begin with a short oral story and end with an activity.\n\nImportant: You must pre-register for this event on the library website in addition to signing up through CIRCLE. A reminder email will be sent out to those who sign up for this class.","displayLocation":"Wauwatosa Public Library, 7635 W North Ave Wauwatosa, WI 53213 United States","date":"2023-12-28T00:00:00.000Z","startTime":"1899-12-30T10:30:00.000Z","endTime":"1899-12-30T11:30:00.000Z","repeats":"No","classMinimum":"none","classMaximum":"12 Book Explorer participants","fee":"none","supplies":"Please bring a book that you have already read or currently reading (does not have to fit with the theme each meeting) to tell us a little bit about it."},{"classTitle":"Not Back to School Picnic","displayLocation":"Pike Lake","address":"3250 Kettle Moraine Rd, Hartford, WI 53027","date":"2023-09-06T00:00:00.000Z","repeats":"No","classMinimum":"5 families","classMaximum":"None","fee":"None","latitude":"43.30739480936721","longitude":"-88.32101010319091"},{"classTitle":"CIRCLE Halloween Party","displayLocation":"Homestead Hollow County Park N120 W19809 Freistadt Road, Germantown, WI 53022","latitude":"43.23465837238555", "longitude":"-88.15533694901082","address":"N120 W19809 Freistadt Road, Germantown, WI 53022","date":"2023-10-27T00:00:00.000Z","repeats":"No","classMinimum":"7 families","classMaximum":"None","fee":"$7/family"},{"classTitle":"Gaga Ball","displayLocation":"Sussex Village Park","address":"W244N6125 Weaver Dr, Sussex, WI 53089","latitude":"43.13049977413015", "longitude":"-88.23073229908786","date":"2023-11-14T00:00:00.000Z","repeats":"No","classMinimum":"2 families","classMaximum":"None"},{"classTitle":"[MADISON] F231350  Learn to make homemade pretzels","displayLocation":"Location: Liv's Drink Emporium 3140 Edmonton Dr. Sun Prairie","latitude":"43.1887960047714","longitude":"-89.2784895363265","classDescription":"Class Description: Would you like to learn how to make your very own pretzel from scratch?\nJoin us at Liv's Drink Emporium in Sun Prairie and be ready to learn how to mix, twist, and bake a homemade pretzel.\nPlease bring extra cash if you would like to purchase a drink or snack.\n*If you have allergy concerns, please let us know. However, everything baked in the store may have cross contaminated with nuts*"},{"classTitle":"[MADISON] F231900 Betty Brinn (Build a Fort)","displayLocation":"Location: 929 East Wisconsin Ave Milwaukee WI 53202","latitude":"43.039166099200756","longitude":"-87.89989634636328","classDescription":"Class Description: We will start our visit in the Maker Space. Working in teams, we will learn about structure and shape and using real building materials we will construct (and maybe demolish!) a fort. Afterwards, we will have 1.5 hours for self guided play in the rest of the museum."},{"classTitle":"[MADISON] F232600 Haven's Petting Farm Visit","displayLocation":"Location: 2894 N Erbe Rd, Blue Mounds, WI 53517","latitude":"43.0144192713493","longitude":"-89.78426843472084","classDescription":"Class Description: People of all ages will love getting to interact with all the animals at Haven's Petting Farm. From kittens and bunnies to ducks, cows and even a zebra, Haven's allows visitors to touch, feed and hold many of the animals at their farm. Located in the rolling hills of Blue Mounds, the farm offers pony rides, a hay maze and an amazing pit of corn for the kids to play in."},{"classTitle":"[MADISON] F233500 Epic Tour!","displayLocation":"Location: 1979 Milky Way Verona WI","latitude":"42.99711998331677","longitude":"-89.56826009576064","classDescription":"Class Description: We will enjoy a 1 hour tour of the indoor and outdoor spaces of Epic Campus. Campus boasts buildings dedicated to such oddities as Alice in Wonderland, Charlie and the Chocolate Factory, Harry Potter and others. The art, and artistry is mind boggling!"},{"classTitle":"[MADISON]  F233700 Hoard Historical Museum Mystery of the Mounds","displayLocation":"Location: 401 Whitewater Avenue Fort Atkinson WI 53538","latitude":"42.9235421126094","longitude":"-88.83505793606437","classDescription":"Class Description: Join us for a visit at the Hoard Museum in Fort Atkinson, with a focus on the Mysteries of the Mounds Exhibit. We will learn about the civilizations that lived in this area and the type of earthen mounds they built. We will also have some hands-on activities. We will get to hold and discuss some of the archeological tools and discoveries and brain storm what they might have been used for. We will also work in teams to build some structures using kinetic sand. We can have lunch on the lawn outside afterwards. If the weather does not cooperate, we can use a classroom upstairs. After lunch my family plans to go on a hike to see some of these mounds. We have a choice between Aztalan State Park (a state sticker or daily pass is required for parking) or the Effigy Mounds Preserve (free street parking)."},{"classTitle":"[MADISON] F234100 Enchanted Valley Acres Field Trip","displayLocation":"Location: 5047 Enchanted Valley Rd. Cross Plains, WI 53528","latitude":"43.130934797970056","longitude":"-89.61394294110676","classDescription":"Class Description: Fall Fun at the Farm!"},{"classTitle":"[MADISON] F234400 Monster Gelatin Brains and Cookie Bites","displayLocation":"Location: Wyndham Hills Park , 675 N. Heatherstone Drive Sun Prairie, WI 53590","latitude":"43.18981001995056","longitude":"-89.28207250043445","classDescription":"Class Description: Let’s enjoy spooky season by playing in gelatin brains and by making monster treats. We will first whip up delicious monster energy bites with tasty ingredients but most importantly, candy monster eyes to finish them off. Later you’ll be able to eat your creations!"},{"classTitle":"[MADISON] F234700 Which is scarier? Dead or Alive???","displayLocation":"Location: TBD on the Northside, in or near Warner Park","latitude":"43.128014004419015","longitude":"-89.37033508729809","classDescription":"Class Description: Creepy creatures!\nWe've got both kinds: gross AND frightening; dead AND alive!\nFace your fears!\nKeepers of wicked-icky pets and makers of m̶a̶c̶a̶b̶r̶e̶ \"creative\" things with animal remains will show and tell about their...hobbies. And guess what, pets we call \"creepy\" can actually be quite nice!\nSee, touch, ask, learn. Then go home and beg a parent to fill your room with more creepy stuff? [Haha, parents! You get used to it.]\nFeel free to bring your own (safe) creepy dead stuff or things made with creepy dead stuff for the Creepy Dead Stuff Showcase. :-)"}]
